[
    {
        "courseOffered": "upcoming",
        "Department": "Biological Sciences",
        "Professor": "Jamma Trinath",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "ROLE OF MICRO RNA IN REGULATING IMMUNE CELL FUNCTION",
        "ProjectDescription": "Activation of immune cells by pathogens and subsequent elimination of infection is the major attribute ofimmune system. However, exaggerated inflammation-due to hyper immune cells activation is detrimental to the host. To curtail this, host is fitted with inherent regulatory loops to bring down the activated immune cell function using a variety of non coding RNAs including micro RNA. In the given project (SOP), a pool of micro RNA will be identified that regulates such immune cell activation in the context ofinflammation associated disorders.",
        "Prerequisite": "Cell biology, Immunology, Cell Signaling"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Biological Sciences",
        "Professor": "Kirtimaan Syal",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "MECHANISMS OF PATHOGEN'S PERSISTENCE AND HOST SUSCEPTIBILITY",
        "ProjectDescription": "Tuberculosis, caused by Mycobacterium tuberculosis, has re-emerged as a threat to human race. It is claimed that every third person across the globe carries this pathogen in the latent form but it is highly likely that the subject may never experience any symptom in his/her lifetime. The genetic determinants that lead to the conversion of latent form to the active tuberculosis are not clear. Here, the ME student will be studying various genetic markers that are more (or less) expressed in tuberculosis patients. The list of the genes has been already compiled. We are collaborating with AIIMS Bhubaneshwar for this part of the project. Further, the frequent failure of antibiotic treatment is one of the world’s most pressing public health problems. Such frequent failure is predominantly attributed to the emergence of drug resistance.Indeed it was not long after the beginning of the antibiotic era that the first resistant organisms appeared1. It is now known that bacteria develop resistance towards most if not all clinically used antibiotics. The student will be getting the opportunity to work on the various proteins involved in multiple drug resistance. We are collaborating with IISER-Bhopal for this part of the project.What student will get? - The student will get the opportunity to learn different biochemical and molecular biology methodologies such as protein purification, western blotting, chromatography, SDS-PAGE electrophoresis, DNA gel electrophoresis, RT-PCR and may also work on the clinical samples in the project.Further, student will be exposed to various tools of computational biology and bioinformatics.",
        "Prerequisite": "Interest, writing skills"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Biological Sciences",
        "Professor": "Kumar Pranav Narayan",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "DESIGNING AFFORDABLE KIT FOR ORAL CANCER DIAGNOSTICS",
        "ProjectDescription": "Need a group of two to three like minded students. I work on receptor mediated drug/gene delivery system for cancer therapeutics. I wish to develop an affordable kit for oral cancer diagnosis as a plate form test. We have already proven concept/experience for identifying cancer cells, we wish to design and develop a cheap and affordable tool to read the fluorescent emissions. Background of design part is also available.",
        "Prerequisite": "Biology/chemistry dual with EEE or ECE or Mech or Instrumentation."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Biological Sciences",
        "Professor": "Ramakrishna Vadrevu",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "MOLECULAR DYNAMICS SIMULATIONS ON PROTEIN STRUCTURE AND STABILITY",
        "ProjectDescription": "Exploring the affect of cell-like conditions on protein structure and function using Molecular Dynamics Simulations. The simulations will be performed using the High Performance Computing Facility (Hyd Campus)",
        "Prerequisite": "Biochemistry, Biophysics, Bioinformatics ((one of them) is highly preferred but notmandatory"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Biological Sciences",
        "Professor": "Sankar Ganesh P",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "RAPID ANAEROBIC DIGESTION OF ORGANIC FEED STOCK",
        "ProjectDescription": "This project will focus on combining ruminant biology with anaerobic digestion of organic waste to hasten the process and reduce the sludge retention time to the minimum. Enzymatic influences to the biochemical process of anaerobic digestion will be studied.",
        "Prerequisite": "Good understanding of biochemistry, animal physiology and microbiology"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Biological Sciences",
        "Professor": "Sankar Ganesh P",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "IDENTIFICATION AND CHARACTERIZATION OF MICROPLASTICS IN FMCG",
        "ProjectDescription": "Microplastics are the small pieces of plastic particles which get released into the environment either due to fragmentation of large plastic particles, or various industrial activities. Microplastic particles and fibers are widely distributed pollutant in the food and agriculture systems. This project will focus on identification and characterization of microplastics in Fast Moving Consuming Products (FMCG).",
        "Prerequisite": "Knowledge on organic and polymer chemistry"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Biological Sciences",
        "Professor": "Sankar Ganesh P",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "VALIDATION OF PROTOCOLS FOR THE ISOLATION OF MICROORGANISMS FROM LANDFILL LEACHATE",
        "ProjectDescription": "Landfill leachate have high amounts of toxic compounds such as refractory organics, ammoniacalnitrogen, microplastics and xenobiotic compounds which can cause severe environmental issues. Indigenous microorganisms capable of degrading the above mentioned components have to be isolated from the source, in order to withstand the toxic effect of landfill leachate during its treatment. Hence, this project focuses on validation of various protocols that are available, for the isolation of these indigenousmicroorganisms.",
        "Prerequisite": "Good knowledge of Biochemistry & Microbiology"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Biological Sciences",
        "Professor": "Sankar Ganesh P",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "SIMULATION OF ANAEROBIC DIGESTION PROCESS USING VARIOUS ANAEROBIC DIGESTION MODELS.",
        "ProjectDescription": "This is a study oriented project which focuses on simulation of anaerobic digestion process using various available anaerobic digestion process. There are various simulation and mathematical models which are available for simulating an anaerobic digestion process. This simulation will give us an opportunity to validate the work done in laboratory.",
        "Prerequisite": "Candidate (preferably from Chemical Engineering) should have knowledge on simulation and understanding of various biological reactions and equations."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Biological Sciences",
        "Professor": "Sankar Ganesh P",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "CONTROL OF ACIDIFICATION IN ANAEROBIC DIGESTERS TREATING FOOD WASTE",
        "ProjectDescription": "The major crisis that anaerobic digestion of food waste face is the acidification of the reactor. Hence, this project focuses on anaerobic digestion of food waste, where the candidate will perform literature survey, to identify typical buffering agents that are required adjusting the pH of the reactor. The candidate will compile the literature survey and propose a particular organic buffering agent for adjusting the pH of the reactor, instead of chemical reagents which are currently in practice.",
        "Prerequisite": "Knowledge on various biochemical pathways and microbiology of anaerobic digestion."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Biological Sciences",
        "Professor": "Sridev Mohapatra",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "THE INTERACTION BETWEEN PLANTSAND BENEFICIAL SOIL BACTERIA",
        "Prerequsite": "Plant Physiology BIO F 312"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Biological Sciences",
        "Professor": "Sridev Mohapatra",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "PLANT GROWTH PROMOTINGRHIZOBACTERIA",
        "Prerequsite": "Plant Physiology BIO F312"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Biological Sciences",
        "Professor": "Suman Kapur",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "ASSAY FOR ENZYMES FOUND INHUMAN LEUKOCYTES",
        "ProjectDescription": "Compare available enzyme activity assays used for clinical testing for pus cells",
        "Prerequisite": "General Biology andBiochemistry courses"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Biological Sciences",
        "Professor": "Suman Kapur",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "ALLELE DETERMINATION IN HUMANDNA SAMPLES",
        "ProjectDescription": "PCR based detection of specific alleles for human genes",
        "Prerequisite": "Basic BIO CDCs"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Biological Sciences",
        "Professor": "Suman Kapur",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "DETECTION OF ADULTERANTS IN MILK",
        "ProjectDescription": "standardize tests for quality control of milk",
        "Prerequisite": "Basic Bio CDCs"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Afkham Mir",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "GRAPHENE BASED SUPERCAPACITORS",
        "ProjectDescription": "To develop a non-toxic, inexpensive to produce graphene based ultracapacitor.No. of students: 2 (max)"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Afkham Mir",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "DESIGN STRATEGIES FOR GRAPHENE- BASED SUPERCAPACITOR ELECTRODES",
        "ProjectDescription": "To study the viability of local structural engineering as a tool to optimize graphene derivatives for use as supercapacitor electrodes, potentially increasing their theoretical charge storage capacity by severalfold."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Afkham Mir",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "TWISTED BILAYER GRAPHENE IN ENERGY STORAGE DEVICES",
        "ProjectDescription": "Slots: 2"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Afkham Mir",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "TAKING GRAPHENE OUT OF THE LABORATORY AND INTO THE REAL WORLD",
        "ProjectDescription": "This includes scaling up of the electrochemical exfoliation of graphite for industrial scale graphene production.",
        "Prerequisite": "Chemical Reaction Engineering"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Afkham Mir",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "TAKING GRAPHENE OUT OF THE LABORATORY AND INTO THE REAL WORLD",
        "ProjectDescription": "This includes working the dynamics of scale up for the electrochemical exfoliation of graphite for industrial scale graphene production.",
        "Prerequisite": "Chemical Reaction Engineering"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Afkham Mir",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "GRAPHENE BASED SUPERCAPACITORS",
        "ProjectDescription": "Slots: 2"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Afkham Mir",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "IMPROVING THE CHARGE CAPABILITIESOF LAYERED MATERIALS",
        "ProjectDescription": "this is a computation based project wherein DFT principles will be used"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Afkham Mir",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "2D LAYERED MATERIALS"
    },{
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Afkham Mir",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "FABRICATION OF 2D LAYERED MATERIALS"
    },{
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Afkham Mir",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "GRAPHENE-BASED MATERIALS FOR BIOMEDICAL APPLICATIONS",
        "ProjectDescription": "Graphene-based nanomaterials have unique properties like high surface area, high thermal and electrical conductivity, etc. In this project, the student is expected to review recent advances in the use of graphene- based materials for biomedical application such as biosensors, bioimaging, biomedical coatings, and soon. This project will be co-supervised by Dr. Debirupa."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Amarthaluri Satyapaul Singh",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "CATALYSTS DESIGN FOR CO2 TO VALUE ADDED FUELS",
        "ProjectDescription": "CO2 is one of the global warming agent. Capturing and its utilization to convert into value added products is an effective way to address CO2 emissions. The project tasks are catalyst synthesis, characterization and conducting thermocatalytic reactions. As it is a DST funded project, highly motivated students towards experimental research are encouraged to apply. Fundamentals of Chemical engineering courses such as thermodynamics, transport process (heat, mass and momentum) and reaction engineering are feasible.Students with physical chemistry background also can apply. By any chance the next semester is going to be online mode then the project will be withdrawn.Selection of the candidates will be based on,1. Brief write-up on the project topic2. Personal interview",
        "Prerequisite": "Good understanding about thermodynamics, materials science"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Amarthaluri Satyapaul Singh",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "CORE-SHELL CATALYSTS DEVELOPMENT FOR PHOTOCATALYTIC REFORMING AND H2 GENERATION",
        "ProjectDescription": "Hydrogen is a clean energy fuel and it is a valuable resource for proton exchange membrane fuel cells (PEMFC). There is no doubt that one of our future energy source is going to be H2. Core-shell catalysts are a class of advanced materials having salient electronic and catalytic properties. The project tasks are development of synthesis protocols for core-shell materials, synthesis of advanced materials, setting up the photocatalysis experimental design and testing the materials performance. As it is a funded project, highly motivated students towards experimental research are encouraged to apply. Fundamentals of Chemical engineering courses such as thermodynamics, transport process (heat, mass and momentum) and reaction engineering are feasible. Students with physical chemistry background also can apply. By any chance the next semester is going to be online mode then the project will be withdrawn.Selection of the candidates will be based on,1. Brief write-up on the project topic2. Personal interview",
        "Prerequisite": "Good understanding about thermodynamics, materials science"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Amarthaluri Satyapaul Singh",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "THERMODYNAMICS AND TECHNO- ECONOMIC ASPECTS OF BIOGAS TO H2 CONVERSION PROCESS",
        "ProjectDescription": "Biogas is an energy source that can be obtained from the organic waste. Already our university is equipped with one biogas plant and another is yet to be established. As a part of the project, the process plant will be developed in ASPEN PLUS and the onsite data needs to be considered to understand the techno-economic analysis (TEA). TEA would be helpful for understanding the possible scale-up plants in future. Already my team at BPHC involved in societal responsibility projects. As a part of this project, the technology transfer to the nearby villages will be done as per the simulated data to establish the large scale plants. As it is a funded project, timely deliverables are expected. Fundamentals of Chemical engineering courses such as thermodynamics, transport process (heat, mass and momentum) and reaction engineering are feasible. Experience in handling any ASPEN PLUS related projects/problems is essential.Selection of the candidates will be based on,1. Brief write-up on the project topic2. Personal interview",
        "Prerequisite": "A very good understanding of thermodynamics, transport process (heat, mass and momentum) and reaction engineering"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Arnab Dutta",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "ML-BASED MODEL DEVELOPMENT FOR BIOLOGICAL SYSTEMS",
        "ProjectDescription": "Machine learning techniques will be implemented to develop models for property prediction. Theapplication domain will be in the broad area of biological systems. The project will be co-supervised by Dr. Debirupa Mitra (Asst. Prof. Chemical Engineering Department).",
        "Prerequisite": "Programming knowledge(MATLAB/Python) is essential."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Arnab Dutta",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "ML-BASED MODEL DEVELOPMENT",
        "ProjectDescription": "Machine learning techniques will be investigated to develop predictive models. The student is free tochoose any system of his/her interest, provided there is availability of suitable database for the chosen system. The student should come up with an application of the developed predictive model from the broad perspective of chemical engineering domain. One is expected to develop model(s) as a part of this project, only mere reviewing of papers is not acceptable.",
        "Prerequisite": "Programming knowledge (MATLAB/Python) is essential."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Arnab Dutta",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "PROCESS SIMULATIONS OF ENERGY SYSTEMS",
        "ProjectDescription": "In this project, a commercial process simulator like HYSYS (Aspen Plus) will be used to develop process simulation models for sustainable energy systems. In this context, one such focus can be in the area of Liquefied Natural Gas (LNG)-based processes, given India's mission towards natural gas-based economy.Simulation will be followed by detailed technoeconomic analyses.",
        "Prerequisite": "Knowledge of Aspen Plus/HYSYS together with process synthesis & designwill be required."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Arnab Dutta",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "DEVELOPING SURROGATES FOR DYNAMIC MODELS",
        "ProjectDescription": "A surrogate model is one that can mimic the actual process using only input-output data. In this project,the focus will be on developing surrogate (metamodels) models for dynamic systems. Data required for developing the surrogate needs to be generated by using a system of ODEs and solving them in MATLAB. Using these data the surrogate will be developed based on different techniques like ANN, Kriging, Response Surface modeling, etc. However, it is to be noted that these techniques need to be applied on datasets obtained for dynamic systems. Dynamic surrogates have utilities in fault detection, processcontrol, etc.",
        "Prerequisite": "Programming knowledge in MATLAB is essential."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Arnab Dutta",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "SURROGATE MODEL DEVELOPMENT FOR CHEMICAL PROCESSES",
        "ProjectDescription": "A surrogate model is one that can closely mimic the actual process using only input-output data. In thisproject, the focus will be on developing surrogate models for chemical processes. A chemical process need to be simulated first in HYSYS, and then required input-output data should be generated using the simulated model. Based on these data points, a surrogate for the process is to be developed. Such surrogates can be of help in process optimization, thus aiding in decision-making. Programming for surrogate development has to be done in MATLAB.",
        "Prerequisite": "Programming in MATLAB is essential."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "B Nandini",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "FABRICATION OF SUPEROLEOPHOBIC SURFACES",
        "ProjectDescription": "The aim of this project is to study and develop polymer-based surface coatings with anti-finger print andoil-repelling property. Finger print contains amphiphobic oleic acid, which has very low surface energy, high viscosity, and sticks to almost any regular surface. The problem aggravates if one tries to wipe a surface with a cloth, which leads to further spreading of the oil. Certain coatings with micro and nanoscale patterns can minimize the spreading of low surface energy liquids and split them into tiny droplets, which can easily roll off the surface. The coating based on flexible transparent polymeric substrates may be directly integrated on to touch screen devices. We will also look into possible applications of suchcoatings in oil-water separation."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "B Nandini",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "DRYING OF A SOLUTION DROPS ON NANOPATTERNED SURFACES",
        "ProjectDescription": "The study of the evaporative drying of a solution droplet is also important in many critical technologies, such as inkjet printing, coatings, microfluidics, DNA mapping and also in disease detection and early diagnosis. When a droplet containing colloidal particles (like blood) or nanomaterials evaporates on a  solid substrate, a ring-shaped deposit is generally obtained due to an uneven drying process. This is known as the Coffee Stain effect. The objective of this project is to study the footprint upon evaporation of amorphous or crystalline solution drops on surfaces of different surface energies and map the observations to different driving forces such as Marangoni effect and thermo-capillary effect."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "D Purnima",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "HEAVY METAL REMOVAL",
        "ProjectDescription": "This topic is aimed at reviewing the different materials used for heavy metal removal"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "D Purnima",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "CHATERIZATION OF POLYMERCOMPOSITES",
        "ProjectDescription": "This work involves characterization of polymer materials",
        "Prerequisite": "should have done a course inmaterial science"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "D Purnima",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "HEAVY METAL REMOVAL",
        "ProjectDescription": "This project intends to design heavy metal removal using software tool",
        "Prerequisite": "ASPEN plus and knowledgeof biomass characterization"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Debirupa Mitra",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "KINETIC MODELING OF BIOLOGICAL SYSTEMS",
        "ProjectDescription": "This project will involve developing and solving mathematical models (using MATLAB as the platform) for biological systems. For example, the growth of virus (e.g. SARS-CoV-2) in human body can be modelled as a set of ODEs. Solving such models will aid in better understanding of the biologicalprocesses. This project will be co-supervised by Dr. Arnab Dutta.",
        "Prerequisite": "Numerical methods"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Debirupa Mitra",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "UNDERSTANDING MOLECULAR DOCKING",
        "ProjectDescription": "Molecular docking (MD) represents the study of interaction between two molecular structures such as thatbetween two proteins, between a protein and a small molecule (e.g. drug), etc. MD plays a huge role in the process of drug discovery. In this project, the student is expected to review mathematical tools and techniques used in MD and perform at least one case study using an open-source MD package. This project will be co-supervised by Dr. Arnab Dutta.",
        "Prerequisite": "None"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Debirupa Mitra",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "NANO-STRUCTURED ANTIMICROBIAL SURFACES",
        "ProjectDescription": "Bacteria have a tremendous affinity to attach to and colonize solid surfaces that result in detrimentaleffects such as implant infections, food spoilage, marine fouling, etc. Engineering surfaces with nanostructures can alter bacteria-surface interactions, minimize bacterial adhesion, and even kill bacteria. In this project, the student is expected to review and summarize research on the effect of different kinds of nano-structured surfaces on bacterial adhesion, growth, and death. This project will be co-supervised by Dr. Nandini.",
        "Prerequisite": "None"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Debirupa Mitra",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "PREPARATION AND CHARACTERIZATION OF COPPER NANOWIRES",
        "ProjectDescription": "Copper-based nanomaterials find use as catalysts, antimicrobials, and in electronics. Copper nanowires areexcellent candidates for flexible, transparent electrodes, and also hold potential as a precursor to fabricating copper-based antimicrobial coatings. The synthesis of copper nanowires with precise dimensions and without the use of harsh reducing agents is still a challenge. In this project, copper nanowires will be synthesized using mild and environmentally-friendly reducing agents. The conditions of synthesis (like temperature, reactant concentration, time, etc.) will be experimentally tuned to achieve an optimal synthesis protocol. The nanowires thus synthesized will be characterized for size, structure, stability, and so on.",
        "Prerequisite": "None"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Debirupa Mitra",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "PREPARATION AND CHARACTERIZATION OF ENZYME-RESPONSIVE HYDROGELS",
        "ProjectDescription": "Hydrogels that can degrade in the presence of enzymes can be used to fabricate biodegradable medical device coatings, “smart” wound dressings, and targeted drug delivery carriers. In this project, hydrogels with enzyme-responsive behavior will be prepared using naturally-derived polymers. The prepared hydrogels will then be characterized for enzyme responsivity, swelling, viscoelasticity, etc.",
        "Prerequisite": "None"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Debirupa Mitra",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "Stimuli-responsive “smart” antimicrobial materials",
        "ProjectDescription": "Stimuli-responsive materials that either “turn on” or are able to modulate their antimicrobial activity inpresence of a stimulus (such as pH, temperature, light, enzyme, etc.) are considered as the next-generation “smart” antimicrobials. These find application in next-generation wound dressings, food packaging, medical device coatings, and so on. In this project, the student is expected to review recent literature on stimuli-responsive antimicrobials, and provide a chemical engineering perspective to their responsive behavior."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "I Sreedhar",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "CARBON CAPTURE USING NOVEL ADSORBENTS",
        "ProjectDescription": "Literature review, experimental work and Report Making",
        "Prerequisite": "Sincere and Committed, Aptitude for ExperimentalWork"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "I Sreedhar",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "HEAVY METAL REMOVAL THROUGH BIOSORPTION",
        "ProjectDescription": "Literature Review, Experimental Work, Report Making",
        "Prerequisite": "Sincere and Committed, Aptitude for ExperimentalWork"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Iyman Abrar",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "PERFORMANCE EVALUATION OFMICROEMULSION FUELS USING HYBRID MCDM TECHNIQUES",
        "ProjectDescription": "Two students with basic knowledge of multi-criteria decision making can apply."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Iyman Abrar",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "DEVELOPMENT OF WASTE COOKING OIL-BASED MICROEMULSIONS AS A SUSTAINABLE ALTERNATIVE FUEL",
        "ProjectDescription": "The project would mostly include experiments. Two students can apply for this project."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Iyman Abrar",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "DIFFERENT METHODS OF BIODIESELPRODUCTION AND THEIR EFFECTS ON THE FUEL PROPERTIES"
    },{
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Iyman Abrar",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "PERFORMANCE AND EMISSION CHARACTERISTICS OF BIODIESELDERIVED FROM DIFFERENT SOURCES"
    },{
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Iyman Abrar",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "AN OVERVIEW OF MICROEMULSIONFUELS FOR SPARK-IGNITION ENGINES"
    },{
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Iyman Abrar",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "ENGINE PERFORMANCE OF MICROEMULSION FUELS FOR SPARK-IGNITION ENGINES"
    },{
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Karthik Venkateshan",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "DEVELOPMENT OF VALUE-ADDED COMPOSITE PROTOTYPES BY USING BIOLOGICAL AND PETROLEUM BASEDMATERIALS",
        "ProjectDescription": "toughening of epoxy composites for defence and aerospace applns and developing novel biomaterial based green products",
        "Prerequisite": "good attitude comprising of thin skin and no drama"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Karthik Venkateshan",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "HOW TO LEARN TO LEARN",
        "ProjectDescription": "A SOP on the nine yards of learning and the intangibles of the same",
        "Prerequisite": "no drama and good attitudewith thin skin"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Pankaj Kumar",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "DEPOLYMERIZATION OF LIGNIN (LIGNOCELLULOSIC BIOMASS)  TO CHEMICALS AND FUELS",
        "ProjectDescription": "In the past few decades, significant attention has been devoted to utilize the carbon-neutral renewable source (biomass) for fuel and chemical production worldwide to reduce dependency on fossil fuels, ensure energy security, and a sustainable environment. Since last year in India, direct burning of agriculture residues (wheat straws, rice straws, corncob residues) is observed as a serious air pollution in Delhi reason by releasing many persistent organic pollutants. Lignocellulosic biomass (agricultural residues, woody materials and other plant materials) is the natural source of lignin. It consists of three fractions such as cellulose (40-50%), hemicellulose (20-30%), and lignin (10-25%). Lignin is considered as a major by- product in bioethanol production from lignocellulosic biomass, and in pulp and paper industry. Hence, aim of this research work is to develop a sustainable process for lignin de-polymerization to obtain high yield of value added chemicals and fuels."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Pankaj Kumar",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "PRODUCTION OF GREEN DIESEL FROM NON-EDIBLE OIL OVER SUPPORTED METAL CATALYSTS",
        "ProjectDescription": "Renewable energy is considered actively throughout the world to reduce the dependency on fossil fuels and to ensure a healthy environment for our planet. Biomass is the only carbon-based renewable energy resource on the planet earth, and it is also capable of producing all kinds of transportation fuels, called biofuel. The triglycerides are thus considered as ideal biomass for the production of diesel-range biofuels. Hydrodeoxygenation (HDO) is a promising technology in hydrocarbon biorefinery for eliminating oxygen from triglycerides and producing green diesel with a high yield and negligible loss of carbon. This project thus covers various aspects of HDO of triglycerides (non-edible oil), such as the role of heterogeneous catalyst and supports, and the effect of process conditions on the yield of green diesel."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemical",
        "Professor": "Pankaj Kumar",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "DESIGN OF A LIGNIN BIOREFINERY FOR THE PRODUCTION OF VALUABLE CHEMICALS",
        "ProjectDescription": "Lignocellulosic biomass (agricultural residues, woody materials and other plant materials) is the natural source of lignin. The aromatic structure of lignin make it a promising feedstock for the production of bio- based chemicals. Conceptual process design can play a key role for  Depolymerization of lignin into chemicals of viable lignocellulosic biorefinery processes. Hence, this work presents a conceptual design for a recently demonstrated process for lignin depolymerization."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemistry",
        "Professor": "Amit Nag",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "FDTD SIMULATIONS OFNANOPARTICLES",
        "ProjectDescription": "Simulation of the electromagnetic field around the nanoparticles, after excitation with electromagneticradiation.",
        "Prerequisite": "Hard work and motivation tolearn simulation"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemistry",
        "Professor": "Amit Nag",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "APPLICATION OF FRET  FOR TEMPERATURE SENSING",
        "ProjectDescription": "FRET between two fluorophores in a thermoresponsive vesicle will be studied. Detailed analysis of the FRET response will be studied as a function of temperature using a spectrofluorometer.",
        "Prerequisite": "Motivation for hard work and knowledge of fluorescencespectroscopy"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemistry",
        "Professor": "Himanshu Aggarwal",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "SMART MATERIALS FOR SENSING OF HAZARDOUS COMPOUNDS",
        "ProjectDescription": "The project will involve synthesis of new materials for sensing of hazardous compounds using various sensing techniques such as fluorescence and electrochemical route. The student will be expected to lead the project from synthesis till application. Upon successful completion of the project, result will be published in an international journal. Prior knowledge of cyclic voltammetry will be helpful.",
        "Prerequisite": "Good CGPA and interest in material chemistry"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemistry",
        "Professor": "Himanshu Aggarwal",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "FLUORESCENT MATERIALS AS SENSORS FOR WATER PURIFICATION",
        "ProjectDescription": "The project will involve synthesis and characterization of fluorescent materials that will be used for removal of harmful chemicals from water. The project will offer an opportunity to learn various instrumental techniques, and a chance to publish the result in international journal upon successfulcompletion of the project. Prior knowledge of fluorescence technique will be helpful.",
        "Prerequisite": "Good CGPA."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemistry",
        "Professor": "K V G ChandraSekhar",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "DESIGN AND SYNTHESIS OFANTITUBERCULAR AGENTS",
        "ProjectDescription": "The project aims at synthesizing various heterocyclic derivatives and evaluating them for theirantitubercular activity"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemistry",
        "Professor": "N Rajesh",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "NOVEL METHODS FOR DESULFURIZATION OF GASOLINE AND DIESEL",
        "ProjectDescription": "The project involves developing suitable adsorbent materials to capture sulfur containing compounds from gasoline. Through this LOP, the knowledge gained would be in the form of knowing about diverse analytical characterization methods, interpretation and also to sensitize about the consequences of excesssulfur in petroleum products.",
        "Prerequisite": "Chemistry laboratory course at first level and basic knowledge of laboratoryconcepts"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemistry",
        "Professor": "Subit Kumar Saha",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "GEMINI SURFACTANT-INDUCED COMPACTION OF DNA",
        "ProjectDescription": "The long DNA molecules in a pure aqueous solution adopt an elongated coil state because of the electrostatic repulsions between negatively charged phosphate groups of DNA monomers. Gene delivery in gene therapy provides a promising option for the treatment of variety of diseases such as genetic diseases, neurodegenerative disease, malignant tumor etc. DNA molecules face difficulty to cross the negatively charged cell membrane due to its bulky size and highly negative charges. Thus to enable DNA to pass through the cell membrane, gene vectors have to be used. Although viral vectors are the most efficient for this purpose, but they suffer from serious immunogenicity problems. To have the DNA in a compacted form from the unfolded form, the use of cationic co-solutes as nonviral vectors is the best approach. The most commonly studied transfection vehicles are cationic liposomes and polycations. In the present project, gemini surfactants with varying spacer groups are proposed as nonviral vectors. Study would be carried out by means of steady-state and time-resolved fluorescence, fluorescence anisotropy, conductivity, and dynamic light scattering measurements.",
        "Prerequisite": "No prerequisite"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemistry",
        "Professor": "Subit Kumar Saha",
        "isFormal": "Formal",
        "ProjectType": "Special Project",
        "ProjectTitle": "GEMINI SURFACTANT-INDUCED COMPACTION OF DNA AND CYCLODEXTRIN-INDUCED DECOMPCTION OF FOLDED DNA",
        "ProjectDescription": "The long DNA molecules in a pure aqueous solution adopt an elongated coil state because of the electrostatic repulsions between negatively charged phosphate groups of DNA monomers. Gene delivery in gene therapy provides a promising option for the treatment of variety of diseases such as genetic diseases, neurodegenerative disease, malignant tumor etc. DNA molecules face difficulty to cross the negatively charged cell membrane due to its bulky size and highly negative charges. Thus to enable DNA to pass through the cell membrane, gene vectors have to be used. Although viral vectors are the most efficient for this purpose, but they suffer from serious immunogenicity problems. To have the DNA in a compacted form from the unfolded form, the use of cationic co-solutes as nonviral vectors is the best approach. The most commonly studied transfection vehicles are cationic liposomes and polycations. In the present project, gemini surfactants with varying spacer groups are proposed as nonviral vectors.For most applications, decompaction (or unfolding) of DNA is an equally important step because gene activities (transcription and translation) are “on” only in the unfolded state of DNA. Present project proposes use of cyclodextrin for the purpose of decompaction of folded DNA.Study would be carried out by means of steady-state and time-resolved fluorescence, fluorescence anisotropy, conductivity, and dynamic light scattering measurements.",
        "Prerequisite": "No prerequisite"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Chemistry",
        "Professor": "Tanmay Chatterjee",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "IODINE CATALYZED THIOLATIVE ANNULATION REACTIONS FOR THE SYNTHESIS OF BIOLOGICALLY ACTIVE SULFENYL HETEROAROMATICS",
        "ProjectDescription": "In this project we would like to develop a green and practical synthetic methodologyfor the iodine catalyzed thiolative annulation reaction to synthesize new classes of biologically active heterocyclic molecules such as indoles, benzofuran and benzothiophenes. The student will hand-on expertise and learn about how to set up a organic reaction in a small as well as large scale, how to monitor the progress of a reaction, how to optimize the reaction conditions, how to purify the desired product from the crude reaction mixture by column chromatography and also how to characterize a synthesized organic molecule by IR, 1H, 13C NMR and LC-MS analysis.",
        "Prerequisite": "A fundamental knowledge on organic chemistry and reaction mechanism andsuccessful completion of CEL- I (CHEM F242) course."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Anasua Guharay",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "GEOTECHNICAL CHARACTERISATION OFAGRO BASED WASTE MATERIALS",
        "ProjectDescription": "Determination of Index and Engineering Properties of Rice Husk Ash in the lab",
        "Prerequisite": "CE F243, CE F313"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Anasua Guharay",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "FEASIBILITY STUDIES OF USINGCONSTRUCTION AND DEMOLITION WASTE FOR SMART CITIES",
        "ProjectDescription": "Studying journal papers on construction and demolition waste",
        "Prerequisite": "CE F243"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Anasua Guharay",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "ALTERNATE MATERIALS FOR STONECOLUMNS",
        "ProjectDescription": "Reviewing the use of alternate materials for construction of stone columns",
        "Prerequisite": "CE F243"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Arkamitra Kar",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "COLLECTION OF DATA ON ENERGY CONSUMPTION ON CAMPUS TO BE UTILIZED FOR DEVELOPING A NETZERO SYSTEM",
        "ProjectDescription": "Due to the recent focus on conserving energy, it is necessary to analyze the present status of energy consumption on campus. So a survey has to be conducted to find out the relevant details. Based on the information collected, an analysis shall be carried out to find a solution towards minimizing theconsumption and hopefully develop a net-zero system.",
        "Prerequisite": "None"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Arkamitra Kar",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "ROUND ROBIN TESTING OF MECHANICAL PROPERTIES OF CONCRETE MADEWITHOUT CEMENT",
        "ProjectDescription": "To conduct a series of tests on various properties of concrete made from waste materials, without using any cement",
        "Prerequisite": "CE F230"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Arkamitra Kar",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "DEVELOPMENT OF MIX DESIGN FORBACTERIAL CONCRETE",
        "ProjectDescription": "Find the optimal concentration of bacterial cells to design concrete mixes with self-healing capacity underthe atmospheric conditions available at Hyderabad.",
        "Prerequisite": "CE F230"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Bandhan Bandhu Majumdar",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "ROAD SAFETY DATA COLLECTION AND ANALYSIS",
        "ProjectDescription": "The road safety data for Hyderabad needs to be entered, comprehensive database to be developed, Mitigation measures need to be evaluated.",
        "Prerequisite": "CE F244"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Chandu Parimi",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "USING MACHINE LEARNING TO SOLVEMECHANICS PROBLEMS",
        "ProjectDescription": "Using data from numerical simulations to solve mechanics problems using machine learning",
        "Prerequisite": "coding"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Jagadeesh Anmala",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "REMOTE SENSING AND GISAPPLICATIONS IN WATER QUALITY MODELING",
        "ProjectDescription": "Emphasis on latest applications of RS/GIS in (Stream) Water Quality Modeling",
        "Prerequisite": "None"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Jagadeesh Anmala",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "REMOTE SENSING/GIS AND MACHINELEARNING APPLICATIONS IN WATER QUALITY MODELING",
        "ProjectDescription": "RS/GIS and Machine learning applications in (Stream) Water Quality Modeling.",
        "Prerequisite": "None"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Komaragiri Srinivasa Raju",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "CLIMATE BASED RAINFALL-RUNOFF MODELLING USING MACHINE LEARNINGALGORITHMS",
        "ProjectDescription": "Now a days climate change is impacting every sphere of water resources. Present study is oriented towards study the rainfall runoff modelling in climate change framework. Simultaneously machine learning is usedto establish rainfall-runoff relationships",
        "Prerequisite": "Not applicable"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Komaragiri Srinivasa Raju",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "CLIMATE BASED RAINFALL-RUNOFF MODELLING USING MACHINE LEARNING ALGORITHMS",
        "ProjectDescription": "Now a day’s climate change is impacting every sphere of water resources. Present study is oriented towards study the rainfall runoff modelling in climate change framework. Simultaneously machine learning is used to establish rainfall-runoff relationships. Methodology that is developed will be testedwith an Indian case study",
        "Prerequisite": "Knowledge on basics of machine learning helps"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Komaragiri Srinivasa Raju",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "RAINFALL RUNOFF MODELLING USING WAVELET NEURAL NETWORKS IN CLIMATE CHANGE FRAMEWORK",
        "ProjectDescription": "Now a day’s climate change is impacting every sphere of water resources. Present study is oriented towards study the rainfall runoff modelling in climate change framework. Simultaneously machine learning is used to establish rainfall-runoff relationships. Methodology that is developed will be testedwith an Indian case study",
        "Prerequisite": "Knowledge on basics of machine learning helps"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Komaragiri Srinivasa Raju",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "SUPPORT VECTOR MACHINE ANDEXTREME LEARNING MACHINE APPLICATION TO RAINFALL RUNOFF MODELLING IN CLIMATE CHANGEASPECTS",
        "ProjectDescription": "Now a day’s climate change is impacting every sphere of water resources. Present study is oriented towards study the rainfall runoff modelling in climate change framework. Simultaneously machine learning is used to establish rainfall-runoff relationships. Methodology that is developed will be tested with an Indian case study",
        "Prerequisite": "Knowledge on basics of machine learning helps"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Komaragiri Srinivasa Raju",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "ROLE OF MACHINE LEARNING IN DROUGHT STUDIES IN CLIMATE CHANGE FRAMEWORK",
        "ProjectDescription": "Now a day’s climate change is impacting every sphere of water resources. Present study is oriented towards study the drought and related aspects in climate change framework. Simultaneously machine learning is used to understand these aspects. Methodology that is developed will be tested with a Indiancase study",
        "Prerequisite": "Knowledge on basics of machine learning helps"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Komaragiri Srinivasa Raju",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "APPLICATION OF MACHINE LEARNING IN DROUGHT STUDIES",
        "ProjectDescription": "Now a day’s climate change is impacting every sphere of water resources. Present study is oriented towards study the drought and related aspects in climate change framework. Simultaneously machine learning is used to understand these aspects. Methodology that is developed will be tested with a Indiancase study",
        "Prerequisite": "Knowledge on basics of machine learning helps"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Mohan S C",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "DEVELOP A MATLAB PROGRAM TO MODEL AND ANALYZE A BUILDING WITHINFILL WALL DIAPHRAGM.",
        "ProjectDescription": "One should have sound knowledge of matlab programming and analysis of structures. FEM will be added advantage",
        "Prerequisite": "Analysis of Structures."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Mohan S C",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "DEVELOP A MATLAB PROGRAM TO MODEL AND ANALYZE A BUILDING FRAME WITH SLAB (RIGID AND SEMIRIGID)",
        "ProjectDescription": "One should have sound knowledge of matlab programming and analysis of structures. FEM will be added advantage. Initial matlab program to analyze space frame will be provided",
        "Prerequisite": "Analysis of structures"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Mohan S C",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "STUDY OF FLEXIBLE CONCRETE SEISMIC APPLICATION AND ITS MIX DESIGN",
        "ProjectDescription": "Study the existing literature to understand the flexible concrete property and its mix design.",
        "Prerequisite": "none"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Mohan S C",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "DOPSTRUCTURAL HEALTHMONITORING OF RAILWAY BRIDGE UNDER MOVING TRAIN LOAD.IT REQUIRES KNOWLEDGE OF USING STAAD TO DEVELOP THE BRIDGE DAMAGE VIBRATION DATA UNDER MOVING LOAD SIMULATION. LATER THAT DATA WILL BE USED IN MACHINELEARNING ALGORITHM.",
        "ProjectDescription": "It requires knowledge of using STAAD to develop the bridge damage vibration data under moving load simulation. Later that data will be used in machine learning algorithm to predict damage. One has to develop a interlink between Staad and matlab to automatically simulate the damage response in bridge.",
        "Prerequisite": "Analysis of Structure"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Murari Raja Raja Varma",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "EMISSION  FACTORS FOR TRANSPORTATION SECTOR",
        "ProjectDescription": "The National Clean Air Programme (NCAP) that mandates cities which do not meet clean air standards to reduce particulate air pollution by 20-30 per cent by 2024. All city clean air action plans, therefore, have included strategies to control emissions from transport sector to meet the clean air target, as the transport sector’s contribution to overall pollution concentration, load and exposure is substantial. There is therefore a demand for deeper understanding of the multi-pronged strategies needed to control vehicular pollution.",
        "Prerequisite": "desirable - CE F323 - Intro to environmental engineering"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Murari Raja RajaVarma",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "NET ZERO BUILDINGS AND CAMPUS"
    },{
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Murari Raja RajaVarma",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "HYDROLOGICAL MODELING",
        "Prerequsite": "Desirable - CE F321 -Hydrology"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "P N Rao",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "ANALYSIS OF STRUCTURES UNDERLATERAL LOADS",
        "Prerequsite": "Mechanics of solids andAnalysis of Structures"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "P N Rao",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "ANALYSIS OF COMPOSITE STRUCTURES",
        "Prerequsite": "Mechanics of solids,Analysis of Structures"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "P N Rao",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "SMART  AGGREGATES",
        "Prerequsite": "Construction   materials"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "P N Rao",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "SUSTAINABLE  MATERIALS",
        "Prerequsite": "construction materials"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "P N Rao",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "SUSTAINABLE  TECHNOLOGIES",
        "Prerequsite": "construction materials"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "P Raghu",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "COMPUTATIONAL DAMAGE MODELING IN STRUCTURES",
        "ProjectDescription": "This work involves modeling the damage in structures subjected to different kinds of external load. The evolution of damage can be tracked by using the techniques such as Phase field. The work is highly computational requires basic skills in Finite element method, calculus and MATLAB (or anyprogramming language)",
        "Prerequisite": "Solid Mechanics, Analysis of Structures"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Shivang Shekhar",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "VULNERABILITY ASSESSMENT OF BRIDGES AGAINST NATURAL AND ENVIRONMENTAL HAZARDS",
        "ProjectDescription": "During the design service life, bridges are continuously exposed to multiple environmental stressors such as corrosion deterioration along with intermittent natural hazards such as floods and earthquakes. The main objective of this study is to understand the vulnerability of bridge and bridge networks againstnatural and environmental hazards.",
        "Prerequisite": "3rd and 4th Year Students"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "V Vinayaka Ram",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "PCM BASED ROOF CEILINGCOMPOUND FOR GREEN BUILDINGS",
        "ProjectDescription": "To make the building green,  this project attempts at reducing the energy demand for cooling needs of thebuildings in tropical weather conditions",
        "Prerequisite": "NIL"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "V Vinayaka Ram",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "NANO ENCAPSULATED PCM BASEDGREEN BUILDING MORTAR",
        "ProjectDescription": "To reduce the energy demand inside the buildings for cooling needs, this project is expected to provide aneffective solution",
        "Prerequisite": "NIL"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "V Vinayaka Ram",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "GEOPOLYMER BASED CONCRETEPAVEMENTS",
        "ProjectDescription": "Experimental studies towards the development of GPC based pavements",
        "Prerequisite": "NIL"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "V Vinayaka Ram",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "GEOTEXTILES AS GRANUALR SUBBASECOURSE IN FLEXIBLE PAVEMENTS",
        "ProjectDescription": "Study the drainage and strength  with geotextile as a replacement of GSB layer in a flexible pavementstructure",
        "Prerequisite": "CE F244 HighwayEngineering"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "V Vinayaka Ram",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "EXPERIMENTAL STUDIES ON RECYCLEDASPHALT PAVEMENTS",
        "ProjectDescription": "Proposed to conduct some advanced studies on the RAP based mixtures as well as RAP extracted binders",
        "Prerequisite": "CE F244 HighwayEngineering"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "V Vinayaka Ram",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "POROUS CONCRETES WITH GEOPOLYMERBINDERS",
        "ProjectDescription": "Develop M30 grade porous concrete with Geopolymer binders",
        "Prerequisite": "CE F244"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Vasan A",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "OPTIMIZATION OF WATERDISTRIBUTION NETWORK DESIGN",
        "Prerequsite": "Matlab Coding skills"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Vasan A",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "LEAK DETECTION OF WATER DISTRIBUTION NETWORKS USINGMACHINE LEARNING",
        "Prerequsite": "Coding skills"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Civil",
        "Professor": "Vasan A",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "MULTIOBJECTIVE OPTIMIZATION USING NATURE INSPIRED ALGORITHMS",
        "Prerequsite": "Coding Skills"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Ayan Das",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "TECHNICAL DOMAIN IDENTIFICATION",
        "ProjectDescription": "The different NLP tools have been found to be sensitive towards the domain of the data that is used totrain the models. For example, a machine translation system trained on data derived from news corpus may not perform well when applied to data derived from literature domain mainly due to the subtle differences in the pattern of the language used and the domain specific terms.The objective of the project is to develop a language processing tool that potentially impacts research and downstream applications like Machine Translation, Summarization, Question Answering etc. For the downstream tasks (i.e Machine Translation) technical Domain Identification would be the first process. It determines the domain for a given input text and subsequently Machine Translation can choose its resources as per the identified domain. The task can also be viewed at coarse vs fine grained level based on the requirement.For this project, the student is required to develop system/s that automatically identify the technical domain of a given text (a small passage) in specified Langauge (English, Bangla, Gujarati, Hindi, Malayalam, Marathi, Tamil, Telugu). Such a piece of text provides information about specific Coarse grained technical domains like Computer Science, Physics, Life Science, Law etc or the Fine grained subdomains for Computer Science domain, it can be of Operating System, Computer Network, Database etc.",
        "Prerequisite": "Basic understanding of neural networks, Python, Knowledge of pytorch or tensorflow"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Ayan Das",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "UNSUPERVISED TECHNICAL DOMAIN TERMS EXTRACTION",
        "ProjectDescription": "Automatic extraction of domain-specific terms based on relevant domain concepts for a given document isa highly challenging task. Domain Term extraction can be defined as the automated process of identifying terminology from domain specific texts. Domain terms are described as textal span which represent/describe the domain.Domain dependent machine translation needs to pay special attention to the domain configuration especially to the domain terms. Using this as a feature in machine translation (MT) systems has shown benefit for overall translation adequacy.The student is required to develop an unsupervised system/s which automatically identify the technical terms from the given text (a document) of English. Such a document provides information about specific technical domains like Computer Science, Physics, Life Science, Law etc.For this task, the student will be provided with domain specific corpora/text without any tagging and he/she can use these domain specific monolingual data to develop their unsupervised domain termextraction system/s.",
        "Prerequisite": "Machine learning (clustering, neural networks), Python (numpy/tensorflow/pytorch))"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Ayan Das",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "INVESTIGATION OF APPROACHES FOR DEVELOPMENT OF DEPENDENCY PARSERS FOR RESOURCE-DEFICIENT LANGUAGES",
        "ProjectDescription": "Dependency parsing is a very important NLP task whose output is used in several downstream tasks suchas semantic role labelling, relation extraction, question answering, summarization, sentiment analysis and machine translation.Given a sentence in a language, the dependency parser returns the syntactic interpretation of the sentence in the form of a tree structure where the nodes are the words of the sentence and a directed edge between a pair of words indicates a syntactic relation between the words where the relation is derived from an well- defined set of syntactic relations.The  objective  of  this  project  is  to  build  dependency  parsers  for  resource-deficient languages by cross-lingual transfer using resources of other languages, by unsupervised techniques using minimum resources or a combination of both cross-lingual and unsupervised methods.",
        "Prerequisite": "NLP, Neural networks, Python (numpy/tensorflow/pytorch))"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Ayan Das",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "DEVELOPMENT OF A HEALTHCARE DATASET IN INDIAN LANGUAGES FROM SOCIAL MEDIA DATA",
        "ProjectDescription": "A significant number of internet users tend to search for medical information on the web and prefer totreat the internet as the first source to get healthcare information.  However, a large number of unscrupulous users are maligning the entire online media by spreading fake healthcare information. This practice, if goes unchecked may cause severe health related issues to a large population world-wide. Thus the tasks of tracking the spread of such misinformation in the internet and checking the spread of such information is of utmost importance for the well-being of the society.Most of the research in this direction is on data in English language. We wish to explore this problem in the perspective of the Indian languages where it poses several unique challenges.As the first step, we need to develop a dataset that consists of blogs and microblogs containing healthcare- related terms in Indian languages scrapped from social media such as Twitter.The objective of the project is to develop such a dataset derived from Twitter. The student has to develop a crawler that will crawl the tweets from twitter and filter the data based on the language of the tweet and healthcare-related terms. The challenges involved are as follows:1. Detection of language is not straight forward since people tend to use the Roman script to write in Indian languages.2. The words used for a disease in an Indian language may be different from that used in English e.g. 'bukhar' in Hindi is the word for 'fever'. This poses a challenge for detection of domain-specific terms in non-English languages.3. Incorporation of external knowledge to check for healthcare-related terms in the tweets.",
        "Prerequisite": "Java, Python, Networking"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Barsha Mitra",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "ACCESS CONTROL",
        "ProjectDescription": "Implementing Access Control Model using Machine Learning",
        "Prerequisite": "Machine Learning"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Barsha Mitra",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "WEBSITE FINGERPRINTING",
        "ProjectDescription": "Understanding Website Fingerprinting Attacks and Defenses using Machine Learning",
        "Prerequisite": "Machine Learning"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Barsha Mitra",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "DIGITAL FINGERPRINTING",
        "ProjectDescription": "Understanding and Analyzing different types of Digital Fingerprinting like Website Fingerprinting,Browser Fingerprinting and IoT Device Fingerprinting",
        "Prerequisite": "Machine Learning"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Barsha Mitra",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "MALWARE DETECTION",
        "ProjectDescription": "Detection of different types of Malwares",
        "Prerequisite": "Machine learning"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Chittaranjan Hota",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "COMMUNICATION EFFICIENT DISTRIBUTED LEARNING",
        "ProjectDescription": "Going against the traditional way of centralizing data and building a global machine learning model,researchers have tried to develop methods which avoid transfer of data. Federated learning is once such an example which does not transfer data but still needs multiple iterations to converge to a global model. The idea of reducing these communication rounds has been one of the major research directions in the recent past. One such unexplored area in this direction is the use of generative models such as GANs, VAEs, and Naive Bayes approaches.",
        "Prerequisite": "nil"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Chittaranjan Hota",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "HIERARCHICAL/DECENTRALIZED DISTRIBUTED LEARNING",
        "ProjectDescription": "With massive increase in client nodes, the server becomes a bottleneck for training a global model. This challenge needs to be addressed using a hierarchical model with edge/fog nodes adding as intermediaries or a decentralized model where clients form clusters and a leader from the cluster interacts with other leaders. Such approaches need to be discussed and researched in greater detail and issues such failure of leader node, communication efficiency of the architecture etc need to be addressed.",
        "Prerequisite": "nil"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Chittaranjan Hota",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "PRIVACY PRESERVING DISTRIBUTED LEARNING",
        "ProjectDescription": "Using generative models proposed in the above approach automatically leads to the question of privacy ofthe individual clients. It raises questions such as \"What if the server is compromised ?\", \"Can the server regenerate the same kind of data that is available with the clients ?\", \"What happens if the server modifies the parameters and trains the global model ?\". Such research questions need to be addressed when global models are trained using generative models.",
        "Prerequisite": "nil"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Chittaranjan Hota",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "DEFENDING MALICIOUS ATTACKS ON BIO CPS DEVICES",
        "ProjectDescription": "The 4th Industrial revolution (Industry 4.0) encompasses leveraging the Internet of Things (IoT) to realize device-to-device communication by smartly interacting through sensors. The Internet of things (IoT) conceptualizes how to interconnect various physical “Things” with other “Things” over the “Internet”.Smart Sensors are one such crucial “Things” paving way towards realizing turnkey, self-monitoring, automated and remotely controllable smart devices. In this project you will develop such IoT enabled plug- and-play smart devices focusing on better accuracy, rapid detection, data analysis/transfer and security.",
        "Prerequisite": "nil"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "D V N Siva Kumar",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "FORWARD AND BACKWARD SECURE SEARCHABLE ENCRYPTION",
        "ProjectDescription": "This project is aimed at developing an approach for performing dynamic updates (insertion and deletion)securely at the cloud servers. It needs to be ensured that no information about the updates should be leaked to the cloud server while incorporating the existing indexes' updates.  This approach focuses on facilitating the data owners to update their stored documents at cloud servers securely and to enable both owners and users to retrieve the documents of their interest securely without revealing any informationabout the queries and documents to the cloud server.",
        "Prerequisite": "Basics of Cryptography, and Information Retrieval and need to be good at any one of the programming languages: C, C++, Java, Python."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Dipanjan Chakraborty",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "Voice-based Information System",
        "ProjectDescription": "Most information systems assume a degree of literacy on the part of the users. That assumption does not hold true for the new users of the Internet. In this project we are aiming to build an Information Systems for Indian farmers which is accessible through voice. This part of the project will require the student to work on IR techniques at the back-end and build the front-end using Google Assistant and other platforms. Fill the form here if you are interested: https://forms.gle/e6WUh87ZXUbYq3ry5",
        "Prerequisite": "Pre- reqs are good to know, not hard and fast. PreReqs: IR, FODS"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Dipanjan Chakraborty",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "Voice-based Information System",
        "ProjectDescription": "Most information systems assume a degree of literacy on the part of the users. That assumption does not hold true for the new users of the Internet. In this project we are aiming to build an Information Systems for Indian farmers which is accessible through voice. Student will work with users conducting user testing and mixed methods research. Fill the form here if you are interested: https://forms.gle/e6WUh87ZXUbYq3ry5",
        "Prerequisite": "Pre- reqs are good to know, not hard and fast. PreReqs: HCI, Statistics"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Dipanjan Chakraborty",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "Media and Society -- stance and sentiment",
        "ProjectDescription": "Analyse stance and sentiment on social media and mainstream media on different important issues and compare them with the stance and sentiment of the common people. Fill the form here if you are interested: https://forms.gle/e6WUh87ZXUbYq3ry5",
        "Prerequisite": "Pre- reqs are good to know, not hard and fast. PreReqs: scripting, FODS, ML, DL, NLP"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Dipanjan Chakraborty",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "Media and Society -- influence of media on protests",
        "ProjectDescription": "The world is witnessing big citizen protests quite often (e.g. the ongoing farmers' protests in India). It is also observed that the protests have been parallely happening on social media platforms. In this project we will tie to analyse if social media drive the protests, help organise the protests or are there for the optics. Fill the form here if you are interested: https://forms.gle/e6WUh87ZXUbYq3ry5",
        "Prerequisite": "Pre- reqs are good to know, not hard and fast. PreReqs: scripting, FODS, ML, DL, NLP"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Dipanjan Chakraborty",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "Remote monitoring for bio-gas systems",
        "ProjectDescription": "We are trying to build a low cost alternative for estimating pressure, temperature, pH and humidity within a bio-gas chamber using neural networks on images of the chamber. Fill the form here if you are interested: https://forms.gle/e6WUh87ZXUbYq3ry5",
        "Prerequisite": "Pre- reqs are good to know, not hard and fast. PreReqs: ML, DL, sensors, raspberry pi"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "J Jabez Christopher",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "DECISION SUPPORT SYSTEMS",
        "ProjectDescription": "Design and development of a standalone mobile/web application to support users in decision-making. Thedecision support application  consists of data analysis, dynamic graphical representations and personalized suggestions/predictions. Python build-in packages are integrated with mobile/web applications to train and test the learning models.Required technologies -- Expo, react-native, redux(for state management) and javascript. Android studio to run simulations and pyds package in python to perform data analytical computations and knowledge representations.Animate Graphs in R with gganimate",
        "Prerequisite": "Programming in R is desirable."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "J Jabez Christopher",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "MEDICAL IMAGE PROCESSING APPLICATIONS",
        "ProjectDescription": "Project Description: Building a full stack application which allows users to upload skin images, processthem and return the images for clinicians to view later. The backend for the api is run with NodeJs and image processing is done in a flask server as a microservice. The frontend mobile app is built with React Native to cater to both Android and iOS. All the servers are hosted in AWS EC2 and the images are stored in AWS S3.Project Requirements: NodeJS, Express, MongoDB, Flask, React Native and AWS Services",
        "Prerequisite": "Knowledge on digital image processing operations"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "J Jabez Christopher",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "EMOTION DETECTION FROM SPEECH",
        "ProjectDescription": "(1)Extract Audio features from speech and detect emotions.(2) http://dcase.community/challenge2021/indexKnowledge in signal processing techniques and concepts like Fourier Transforms, DTFT, FFT, etc. should be comfortable with their implementation in Python or MATLAB. Familiar with Pythonic audio processing libraries like Librosa and Parselmouth is desirable. Must be familiar with modelling machine learning systems. Knowledge about statistical tests and data visualization/presentation techniques is desirable.",
        "Prerequisite": "good programming skills in either Python or MATLAB"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Lalita BhanuMurthy Neti",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "CODE COMMENTING USING DEEPLEARNING TECHNIQUES"
    },{
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Lalita Bhanu Murthy Neti",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "APPLICATIONS OF DEEP LEARNING IN SOLVING SOFTWARE ENGINEERINGPROBLEMS"
    },{
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Lov Kumar",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "SOFTWARE SENTIMENT ANALYSIS"
    },{
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Lov Kumar",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "TESTING OF AI APPLICATION"
    },{
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Lov Kumar",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "FAKE NEWS DETECTION"
    },{
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Lov Kumar",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "OBJECT DETECTION USING DEEPLEARNING APPROACH"
    },{
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Manik Gupta",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "POLLUTION SENSING  USING SMARTPHONES AND  REMOTE SENSING",
        "Prerequsite": "Students who are research oriented, possess good writing skills and most importantly, self-driven to produce publications in collaboration with external academic and research partners, need apply. Essential prerequisites are DS minor courses like DM, FODS, ML, DL, AI."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Manik Gupta",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "BUILDING CONVERSATIONAL AGENTS FOR MENTAL HEALTH",
        "Prerequsite": "Students who are research oriented, possess good writing skills and most importantly, self-driven to produce publications in collaboration with external academic and research partners, need apply. Essential prerequisites are DS minor courses like DM, FODS, ML, DL, AI."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Manik Gupta",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "DEEP LEARNING FOR TIME SERIES ANALYSIS",
        "Prerequsite": "Students who are research oriented, possess good writing skills and most importantly, self-driven to produce publications in collaboration with external academic and research partners, need apply. Essential prerequisites are DS minor courses like DM, FODS, ML, DL, AI."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Manik Gupta",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "DEEP LEARNING OPTIMIZATIONS FOR RESOURCE CONSTRAINED DEVICES",
        "Prerequsite": "Students who are research oriented, possess good writing skills and most importantly, self-driven to produce publications in collaboration with external academic and research partners, need apply. Essential prerequisites are DS minor courses like DM, FODS, ML, DL,AI.Knowledge of embedded systems programming, mobile application development is desirable."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Manik Gupta",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "DATA MANAGEMENT CHALLENGES IN EDGE COMPUTING",
        "Prerequsite": "Students who are research oriented, possess good writing skills and most importantly, self-driven to produce publications in collaboration with external academic and research partners, need apply. Essential prerequisites are Computer networks and DS minor courses like DM, FODS, ML, DL, AI.Knowledge of embedded systems programming, mobile application development is desirable."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Manik Gupta",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "VR ENVIRONMENT FOR ATTENTION MONITORING",
        "Prerequsite": "Students who are research oriented, possess good writing skills and most importantly, self-driven to produce publications in collaboration with external academic and research partners, need apply. Essential prerequisites are DS minor courses like DM, FODS, ML, DL, AI.Knowledge of Unity, mobile application development is desirable."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Manik Gupta",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "MULTIMODAL MACHINE LEARNING FOR PHYSIOLOGICAL DATA",
        "Prerequsite": "Students who are research oriented, possess good writing skills and most importantly, self-driven to produce publications in collaboration with external academic and research partners, need apply. Essential prerequisites are DS minor courses like DM, FODS, ML, DL, AI.Knowledge of embedded systems programming, mobile application development is desirable."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Manik Gupta",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "USE OF FOG COMPUTING FOR REAL TIME PROCESSING OF AIR QUALITY SENSOR DATA",
        "Prerequsite": "Students who are research oriented, possess good writing skills and most importantly, self-driven to produce publications in collaboration with external academic and research partners, need apply. Essential prerequisites are DS minor courses like DM, FODS, ML, DL, AI.Knowledge of embedded systems programming, mobile application development is desirable."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Narasimha Bolloju",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "DEVELOPMENT OF A PROBLEM-BASED LEARNING PLATFORM FOR SETTING UP LEARNING TASKS",
        "ProjectDescription": "This project requires a small team to design and develop a web-based problem-based learning platform that facilitates teachers and contributors in setting up learning tasks.  The platform supports users to define exercises in selected topics as problem-based learning activities with multi-level guidance so that small groups of students can solve the problems with optional guidance or tips.",
        "Prerequisite": "Web-application development experience; preferably completed a Software Engineering course"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Narasimha Bolloju",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "DEVELOPMENT OF A PROBLEM-BASED LEARNING PLATFORM TO SUPPORT COLLABORATIVE LEARNING ACTIVITIES",
        "ProjectDescription": "This project involves design and development of a web-based collaboration learning portal where small groups of students can solve some predefined problems selected based on their ability. The entire problem solving sessions are based on a common whiteboard (e.g., Jamboard) via audio discussion among the students.  Each of the problem solving session, with a typical duration of 15 to 20 minutes, are recorded so that other students interested in learning process as explained by the students.",
        "Prerequisite": "web-application development; preferably completed a SE course"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Narasimha Bolloju",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "DEVELOPMENT OF LEARNERTUBE - A PLATFORM FOR OBSERVATIONAL LEARNING",
        "ProjectDescription": "This project involves design and development of a video portal that hosts video recording (work on whiteboard supported with audio) collaborative problem solving tasks.  The users, typical students interested in learning, will be able to go through the videos and comment/rate those videos.  The portal will provide some useful features such as subscriptions and saving links to useful videos as well.",
        "Prerequisite": "web-application development; preferably completed a SE course"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Nikumani Choudhury",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "DEVELOPMENT OF A DISTRIBUTED MACHINE (DEEP) LEARNING TO BE USED OVER IOT DEVICES",
        "ProjectDescription": "Deep learning techniques have revolutionized computer vision technology; however, these approaches require a lot of computation power restricting their use on resource-constrained IoT (Internet of things) devices/nodes. The motivation is to transfer the ML technology to light-weight systems for real-time IoT applications like smart agriculture, smart homes, industrial automation, etc. The conventional techniques mainly focus on splitting the data into smaller fragments to be distributed to the resource-constrained nodes. However, data splitting is not a long-term solution in the real-world unforeseen stream of data. The aim of this project is to parallelise the sequential ML algorithms to be distributed to task-specific IoT devices for computation and hierarchical aggregation.Looking for a group of 2-3 members to work together in a team.",
        "Prerequisite": "A basic understanding of machine learning / deep learning techniques like CNNs is a must.."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Nikumani Choudhury",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "LOW-POWER, LOW-COST COMMUNICATION FOR DSME BASED INDUSTRIAL INTERNET OF THINGS",
        "ProjectDescription": "Internet of Things (IoT) has emerged as one of the leading enabling technologies that connects smart objects and devices over IP networks. It has rapidly evolved over the years supporting different real-time and industrial applications spanning from home automation to healthcare, smart buildings to intelligent transportation, smart agriculture. Several of these applications require Quality of Service (Qos) in terms low and deterministic latency, high throughput, scalability and reliability. The IEEE 802.15.4 standard is one of the widely adopted specifications for realizing different applications of the IoT.  The standard defines several physical layer options and Medium Access Control (MAC) sub-layer protocols for devices with low power operating at low data rates. One such prominent MAC protocol is the Deterministic and Synchronous Multi-channel Extension (DSME), which targets industrial and commercial application domains.This project addresses several challenges in implementing a DSME network.Number of positions: [03]",
        "Prerequisite": "Basic understanding of computer networks"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Nikumani Choudhury",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "AI BASED SMART AGRICULTURE WITH ON-BOARD PROCESSING USING CONVOLUTIONAL NEURAL NETWORK",
        "ProjectDescription": "Smart agriculture aims to provide the agricultural industry an advanced technological infrastructure that includes internet of things (IoT), big data, cloud, robotics, unmanned aerial vehicles (UAVs, drones), and artificial intelligence (AI). Smart agriculture in rural areas can largely benefit from the low-power, low- cost sensors and UAVs to sense (soil, temperature, salinity, water, light, insects, pests) and exchange data/images for monitoring and controlling of the crops. India ranks second worldwide in farm output.This output can be further increased with the use of technology. After sowing the seeds initially most of the crops just require constant monitoring to check for pests, plant disease etc. This is a task which can be automated using artificial intelligence. In this project, we aim to design a fast, low power computing technology to classify the image captured by agricultural UAVs at the edge/fog devices. In other words, we will propose a hardware architecture that facilitates support for the aforesaid monitoring system using object detection models based on CNN.Number of positions: [02]",
        "Prerequisite": "A basic understanding of machine learning / deep learning techniques like CNNs is desirable."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Nikumani Choudhury",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "LOW-POWER, LOW-COST COMMUNICATION IN TSCH BASED INDUSTRIAL INTERNET OF THINGS.",
        "ProjectDescription": "The Internet of Things (IoT) has emerged as one of the leading enabling technologies that connect smart objects and devices over IP networks. It has rapidly evolved over the years supporting different real-time and industrial applications spanning from home automation to healthcare, smart buildings to intelligent transportation, smart agriculture. Several of these applications require Quality of Service (QoS) in terms of low and deterministic latency, high throughput, scalability, and reliability. The IEEE 802.15.4 standard is one of the widely adopted specifications for realizing different applications of the IoT.  The standard defines several physical layer options and Medium Access Control (MAC) sub-layer protocols for devices with low power operating at low data rates. One such prominent MAC protocol is the Time Slotted Channel Hopping (TSCH) MAC, which provides high reliability and low power consumption to various industrial applications. Despite the effectiveness and the importance of the TSCH protocol, the standard leaves out of its scope in defining how the schedule is built and maintained. In this project we address several challenges faced during implementation of a TSCH based IoT network.Number of positions: [02]",
        "Prerequisite": "Basic understanding of computer networks"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Paresh Saxena",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "MEASURING RSRP VALUES VIA DRONES",
        "ProjectDescription": "Development of application over Raspberry Pi to collect RSRP samples with drones",
        "Prerequisite": "Prior experience withRaspberry Pi, Prior experience with flying drones, Understanding of RSRP values"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Paresh Saxena",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "REINFORCEMENT LEARNING (RL) TOOLSFOR VIDEO DELIVERY",
        "ProjectDescription": "Exploration of RL techniques for video streaming",
        "Prerequisite": "RL course and/or RLknowledge"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Paresh Saxena",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "APPLICATION OF MACHINE LEARNING WITH MPTCP/MPQUIC PROTOCOLS",
        "ProjectDescription": "The project requires investigation of state-of-the-art ML tools for development of future transport layer protocols.",
        "Prerequisite": "MPTCP/MPQUIC protocols, Basic knowledge of ML."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Paresh Saxena",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "ADVANCED SCHEDULERS FOR MPTCP/MPQUIC",
        "ProjectDescription": "Purely networking project with the hands-on with existing MPTCP/MPQUIC Raspberry Pi testbed",
        "Prerequisite": "MPTCP/MPQUIC protocols, Network Emulators,Raspberry Pi"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "R Gururaj",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "INVENTORY MANAGEMENT SYSTEM FORCCIT AT BPHC",
        "ProjectDescription": "To design and implement a web-based Inventory management system for CCIT of BPHC.",
        "Prerequisite": "Database Systems andProgramming skills."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "R Gururaj",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "E-WASTE INFORMATION MANAGEMENT SYSTEM FOR CCIT OF BPHC.",
        "ProjectDescription": "To design and implement a web-based information management system for keeping track of E-waste in CCIT of BPHC.",
        "Prerequisite": "Database systems  & Programming skills"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "R Gururaj",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "DESIGN AND DEVELOPMENT OF WEB- BASED CHAT APPLICATION IN JAVA.",
        "ProjectDescription": "To design and development of web-based Chat application using Java programming language using appropriate APIs/Packages.",
        "Prerequisite": "Java Programming."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Raghunath Reddy Madireddy",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "APPROXIMATION ALGORITHMS FOR GEOMETRIC COVERING  PROBLEMS",
        "ProjectDescription": "Geometric covering  problems have several applications in computer science. We are given a set points P in the plane and a set O of geometric objects like disks, squares, lines, etc. The goal is to find a minimum size subset O` of O that covers all points in P. In this project, we study a variation of the problem called red-blue set cover problem. In this problem, we are given two sets of points R and B, a set of objects O, and the goal is to find a subset O` of O that covers all points in B while covering the minimum number of points in R. We design an approximation algorithm for the problem when the objects are unit disks.",
        "Prerequisite": "Design and Analysis of Algorithms"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Rajib Ranjan Maiti",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "CYBER ESPIONAGE ON IOT",
        "Prerequisite": "Python Programming,computer networking, wireshark"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Subhrakanta Panda",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "ANALYZING THE PERFORMANCE OF PATIENT-CENTRIC BLOCKCHAIN-BASED EHR IMPLEMENTATION",
        "ProjectDescription": "Context: Blockchain technology could also play an integral role in storage and distribution of medical images and eventually help in predictive analysis of cancer diagnosis in early phases. This technology has the potential to solve problems of medical data storage and availability, patient health information security, and timely interpretation of medical data studies.Objective: There is a need to store and disseminate large amounts of medical data in the most secured fashion. This project aims to implement Blockchain-based EHR that integrates distributed patient medical records and images using blockchain technology. Further, it is required to analyze the performance of different blockchain solutions with predefined use cases, and get a set of performance test results.Methodology: We will develop different types of EHR Blockchain (public, private and consortium) architecture and then we perform evaluation test by setting a default benchmark engine, Caliper, which is pluggable and configurable to integrate new tests easily. Then, we write a configuration file to define the backend network and benchmark argument. Further we compare different types of Blockchain performance by evaluating network hash rate (security measure) for each node.Results:  We get the result of Blockchain based EHR solutions on the basis of performance indicators like Transaction/Read throughput, Transaction/Read latency (minimum, maximum, average, and percentile), Resource consumption etc. Then, plot the results on the graph for proper analysis of different blockchain.",
        "Prerequisite": "•□Should be well acquainted with Programming languages: Solidity, Web3 js, Python etc.•□Should be confident in ML, and/or Data Mining, Network and Cryptography concepts.•□Should be familiar with Development Tools like Truffle, Ganache (desirable)."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Subhrakanta Panda",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "COMPUTATIONAL MODEL FOR PREDICTING DRUG SIDE EFFECTS IN BREAST CANCER TREATMENT",
        "ProjectDescription": "Context: Drugs refer to the chemical compounds that are consumed by the human body during cancertreatment and induce a change by interacting with the protein targets. The drugs may induce favourable or unfavourable changes in the human body. The unfavourable changes that are elicited by the drugs in the cancerous cells are known as drug side effects. These side effects range from minor reactions like headache to serious reactions such as cardiac arrest, cancer, or even death.Objective: There is an urgent need to work for accurate computational prediction of the response of drugs taken by cancer patients on the patient’s molecular and clinical profiles. This enables doctors as well as patients in making decision process in cancer treatment process.Methodology: For predicting drug side effects, there is a need to have drug response information. Initially, datasets are collected from different repositories like Genomics of Drug Sensitivity in Cancer and Cancer Cell Line Encyclopaedia websites. Some of them are used as training data sets as the input to machine learning techniques. Then, predictive performance of models is evaluated using remaining testing data sets. Further independent validations using clinically relevant data are required to continue bridging the gap between the laboratory and the clinic results.Results: Different experimental and or mathematical procedures will be used to predict drug response that is drug sensitivity measures. Different analysis levels will be graphically represented in terms of drug response measures (sensitivity Vs resistant) to the breast cancer patient.",
        "Prerequisite": "Strong prior knowledge in Programming language like Python/R codingShould have done courses on AI, ML, and/or Data Mining. A flair for self-exploration, innovative, and burning desire to get published will be highly appreciated. Candidates with the above exposures will be given preference."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Subhrakanta Panda",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "TUNING GAN MODEL USING EVOLUTINARY ALGORITHMS TO IMPROVE ACCURACY OF THE DETECTED EVENTS IN A MASSIVE SOCIAL NETWORK",
        "ProjectDescription": "Context: Improve the accuracy of GAN model by tuning the hyperparametrs using evolutionary algorithm.Objective: This project aims to improve the accuracy of GAN by tune the hyperparameters. GAN is capable of representing social interactions among group nodes of a social network.So, in this work, we aim to tune the GAN model to represent the data distribution of interaction changes  of a SN in a graph format. The distribution of the data is analyzed using an optimised function. Analysis of data distribution of the GAN model gives community events of the social network. This distributive value can be analyzed to detect when the pattern is changing from one event to another event.Methodology: We consider an encoder E that maps input data x to a latent representation z, along with a generator G and discriminator D during training. This enables us to avoid the computationally expensive step of recovering a latent representation at test time. We then define a score function A(x) by using optimization function (Cuckoo search, PSO, and ANT colony) to measure how the event of x is, based on a convex combination of a loss function and a discriminator-based loss function. The loss function demonstrates irregular pattern change in the social network and gives it as a score of the community event change.Results: Scores of A(x) are used for classifying data into different events of the community and we evaluate the accuracy, precision, recall, and F1-score of the GAN model to measure the efficiency of the model. Based on the results obtained we will publish research articles and anyone involved in this work will be a co-author.",
        "Prerequisite": "Should have done courses on AI, ML, and/or Data Mining, Optimization strategies (desirable), and should have confidence in Python/R coding. A flair for self- exploration, innovative, and burning desire to get published will be highly appreciated. Candidates with the above exposures will be given preference.  Note: First the existing project students will be selected, thereafter if any slots will be available then other students will be considered. Kindly drop a mail mentioning your credentials (preferable to attach your CV/resume) in support of your candidature for the project. Existing students if applying need not send any email, but should at least inform me verbally. Any publications resulting from this work will have the projectstudents’ names on it as co- authors."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Suvadip Batabyal",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "SCALABLE VIDEO STREAMING IN 5GNETWORKS",
        "ProjectDescription": "How SVC video is stored in distributed edge cache? Optimal service provisioning. Optimal QoE."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Computer Science",
        "Professor": "Suvadip Batabyal",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "PHYSICAL REALIZATION OF A SAMPLE QUANTUM CIRCUIT IN IBM QX",
        "ProjectDescription": "Given a quantum circuit, how to map logical qubits into physical qubits on IBM QX architecture. Challenges and opportunities.",
        "Prerequisite": "Should have basicunderstanding of quantum computing."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Economics andFinance",
        "Professor": "RaghunathanRajasekaran",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "NETWORKING SKILLS",
        "ProjectDescription": "How to develop an individuals networking skills. (The area of work is on soft skills)",
        "Prerequisite": "NA"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Economics and Finance",
        "Professor": "Rishi Kumar",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "Application of econometrics to economic & social issues inIndian context."
    },{
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Alivelu Manga Parimi",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "AI APPLICATION TO POWER SYSTEMS, FAST CHARGING DESIGN FOR EV, MICROGRIDS, AI APPLICATION TO PROSUMER NETWORKS.",
        "ProjectDescription": "AI Applications: Smart cities require AL Applications to handle the data for correlate between energy sources and loads. Need to design algorithms. ]Fast charging design for EV: Design of converters for ramp charging",
        "Prerequisite": "Preferable in AI techniques."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Amit Ranjan Azad",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "STUDY AND ANALYSIS OF MICROWAVE DIPLEXERS",
        "ProjectDescription": "Diplexers are essential components in transceivers for microwave communication systems in order toeffectively separate transmit and receive channels connected to a common antenna. Increasing development of microwave communication systems such as wireless local area network (WLAN) and local multipoint distributions system (LMDS) greatly stimulate the need for compact low loss microwave diplexers which serve as channel separators. The project is based on study and analysis of microwavediplexers used for wireless communication.",
        "Prerequisite": "Microwave Engineering"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Harish Vijay Dixit",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "DESIGN OF NON LINEAR TRANSMISSION LINE STRUCTURES",
        "ProjectDescription": "This project will explore the use of non linear transmission lines to high power microwave systems",
        "Prerequisite": "interest and basic knowledge of electromagnetic field theory"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Karumbaiah C N",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "MNO2 NANO-RODS ELECTRO-CHEMICALSENSING"
    },{
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Karumbaiah C N",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "WATER SPLITTING USING NANOMATERIALS"
    },{
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Karumbaiah C N",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "SUPER-CAPACITOR USING NANOMATERIALS"
    },{
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Karumbaiah C N",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "MINIATURE GAS PLASMA DEVICES"
    },{
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Mithun Mondal",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "DESIGN AND SIMULATION OF HIGH VOLTAGE EQUIPMENTS IN COMSOLMULTIPHYSICS",
        "ProjectDescription": "Electric field and voltage distribution analysis of HV equipments",
        "Prerequisite": "Knowledge of CAD is must and COMSOL/Ansys"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Mithun Mondal",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "CONDITION MONITORING OF POWERTRANSFORMERS",
        "ProjectDescription": "Design and simulation of transformer winding",
        "Prerequisite": "CAD and COMSOL/Ansys"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Pratyush Chakraborty",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "ENERGY MANAGEMENT OF HYBRID VEHICLES",
        "ProjectDescription": "In this project, the goal is to minimize the fuel, carbon emission etc of a hybrid electric vehicle and design the EMS (energy management system) accordingly (I will take two students)",
        "Prerequisite": "Matlab, Strong mathematical skills, Interest in machinelearning, optimization"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Pratyush Chakraborty",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "DESIGN OF LANE CHANGE MANEUVERS FOR AN AUTONOMOUS VEHICLE",
        "ProjectDescription": "When an autonomous vehicle will travel through a road along with a number of manually operatedvehicles, its functions need to be designed carefully because a manual car sometimes don't follow rules and if an autonomous car follows all the rules without any manual driver, it will face problems. So in this project, the goal is to design the lane change function of an autonomous vehicle learning human behavior.(I will take two students)",
        "Prerequisite": "Machine Learning, Strong Interest in Mathematics"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "PratyushChakraborty",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "INVESTIGATING SHARING ECONOMY INA SMART GRID",
        "ProjectDescription": "In this project, we will consider a power distribution network with small solar plants and batteries andinvestigate if the owners can share their resources cooperatively and effectively (two students)",
        "Prerequisite": "Power System,Matlab/Simulink"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Pratyush Chakraborty",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "OPTIMIZATION OF PARAMETERS FOR VANADIUM REDOX FLOW BATTERY",
        "ProjectDescription": "Vanadium Redox Flow battery is one of the promising batteries that can used for future power grid with deep renewable energy penetration. In this work, the plan is to optimize different parameters of the batteryto get efficient and cost-effective output.",
        "Prerequisite": "Optimization, Interest in Maths, Matlab"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "R N Ponnalagu",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "APPLICATIONS OF HALL EFFECT ANDMAGNETIC SENSORS"
    },{
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "R N Ponnalagu",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "SENSOR INTERFACING CIRCUITS"
    },{
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "R N Ponnalagu",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "SENSOR INTERFACING CIRCUITS"
    },{
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Rajesh Kumar Tripathy",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "VERTEX-FREQUENCY ANALYSIS DOMAIN CONVOLUTIONAL NEURAL NETWORK FOR THE CLASSIFICATION OF SLEEP STAGES USING MULTI-CHANNEL EEG SIGNALS",
        "ProjectDescription": "The graph signal processing and graph deep learning are the emerging topics in data science and engineering. The objective of this project is to explore the vertex-frequency domain deep CNN for the sleep stages classification using multi-channel EEG signals.",
        "Prerequisite": "Deep learning and signal processing"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Runa Kumari",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "COCONUT COIR FIBER INSPIRED ANTENNA",
        "ProjectDescription": "Design an antenna with low cost Coconut coir fiber. 1st do the study and analysis on characteristics of coconut coir fiber,do the complete analysis of its properties, compare it with the existed substrate (cupper) which we are using in normal antenna and then the final antenna design with Coconut coir fiber."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Runa Kumari",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "SIMULATION STUDY OF ELECTRONIC BAND GAP MATERIALS FOR MICROWAVE APPLICATIONS",
        "ProjectDescription": "Electromagnetic band gap (EBG) materials has become a significant invention in the radio frequency (RF) and microwave applications due to their exceptional band gap characteristics at certain high frequency ranges. So the project aim to doSimulation study on 2D/3D electronic band gap materials targeting UHF-Ku band application"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Runa Kumari",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "MATHEMATICAL ANALYSIS AND DESIGN OF A KU BAND WAVEGUIDE TRANSMITARRAY ANTENNA FOR SATELLITEAPPLICATION",
        "ProjectDescription": "A sample design of a single beam antenna is required and the E-plane and H-plane patterns should be plotted using the obtained formulations."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Sayan Kanungo",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "FIRST PRINCIPLE INVESTIGATIONS OF2D MATERIALS",
        "ProjectDescription": "Density Functional Theory based investigation on the electronic/sensing properties of 2D materials",
        "Prerequisite": "Basics of SemiconductorMaterials and Devices"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Soumya J",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "MACHINE LEARNING TECHNIQUES FORNETWORK ON CHIP DESIGN",
        "ProjectDescription": "It requires ML basics and Python programming, followed by hardware implementation on FPGA. Thereare 4 vacancies in this project.",
        "Prerequisite": "Python, Verilog, C"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Sourav Nandi",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "DESIGN OF MIMO ANTENNAS FOR 5GAPPLICATIONS",
        "ProjectDescription": "It is basically an antenna DOP. A MIMO antenna is combination of multiple antennas used forhigh speed wireless communication systems.",
        "Prerequisite": "Preferably EMFME course"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Phoenix",
        "Professor": "Sourav Nandi",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "MIMO FOR 5G COMMUNICATION",
        "ProjectDescription": "It is a study where the advantages of multiple antennas are explored for higher data rate communicationpurposes.",
        "Prerequisite": "Communication Systems"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Humanities andSocial Sciences",
        "Professor": "Lavanya Suresh",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "MUNICIPAL SOLID WASTEMANAGEMENT",
        "ProjectDescription": "A policy review of MSW governance and a municipal level institutional analysis",
        "Prerequisite": "The student has to have donea course with me"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mathematics",
        "Professor": "Bivudutta Mishra",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "GEOMETRICAL ASPECTS OF EXTENDED GRAVITY",
        "ProjectDescription": "The observational claim of accelerated expansion of Universe has put Einstein's General Relativity in a fix. The modification in the Einstein's filed equation has been inevitable. The modification in the geometric part leads to the extended gravity and the matter part leads to the concept of dark energy. Theproject would be focused on the geometric modification of Einstein's filed equations.",
        "Prerequisite": "Basic knowledge of Tensor Calculus"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mathematics",
        "Professor": "K Bhargav Kumar",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "NUMERICAL STUDY OF PARTIALDIFFERENTIAL EQUATIONS",
        "Prerequsite": "Analysis and PDE"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mathematics",
        "Professor": "Nabin KumarMeher",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "ALGEBRAIC NUMBER THEORY",
        "ProjectDescription": "Study on ring of algebraic integers, prime factorization, and Dirichlet's unit theorem",
        "Prerequisite": "Ring theory and Field Theoryand Measure theory"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mathematics",
        "Professor": "Pradyumn Kumar Sahoo",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "WORMHOLE GEOMETRY IN MODIFIED GRAVITY",
        "ProjectDescription": "The students will study the wormhole geometry in modified gravity. An overview of what can generally be said about traversable wormhole throats. We discuss the violations of the energy conditions that typically occur at and near the throat of any traversable wormhole and emphasize the generic nature of this result.",
        "Prerequisite": "Differential equations"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mathematics",
        "Professor": "PratyushaChattopadhyay",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "STUDY OF GROUPS",
        "Prerequsite": "Basics of group theory, ringtheory, and linear algebra"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mathematics",
        "Professor": "Sai Lakshmi RadhikaTantravahi",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "PROBLEMS IN APPLIED MATHEMATICS",
        "ProjectDescription": "To work on the areas of mathematics that are applicable to real-world problems",
        "Prerequisite": "MATH F111, MATH F112, MATH F211"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mathematics",
        "Professor": "Santanu Koley",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "STOCHOSTIC MODELING OF OWC DEVICES,     ESTIMATION OF PARAMETERS OF VARIOUS PROBABILITY DISTRIBUTIONS",
        "ProjectDescription": "In the project \"stochastic modeling of OWC devices\", the concept of wave spectrum will be used to model the irregular/random incident waves and will be used to determine the performance of oscillating water column wave energy converter devices in real ocean environment.In the project \"Estimation of parameters of various probability distributions\", novel estimation tools will be used to determine the unknown parameters associated with the probability density functions.",
        "Prerequisite": "MATH F113 (PROBABILITY AND STATISTICS)"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mathematics",
        "Professor": "Sumit Kumar Vishwakarma",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "MECHANICAL STUDY OF WAVES IN HETEROGENEOUS MEDIUM",
        "ProjectDescription": "To study the dependency of mechanical behavior of wave on inhomogeneity coefficients of the medium",
        "Prerequisite": "Differential equation/Calculus/MATLAB/MATHE MATICA"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Abhishek Sarkar",
        "isFormal": "Formal",
        "ProjectType": "Special Project",
        "ProjectTitle": "GAIT ANALYSIS OF QUADRUPED ROBOT",
        "ProjectDescription": "Animals can effortlessly perform many motions. Developing robots that are able to replicate these agile motions can open opportunities to deploy robots for sophisticated tasks in the real world. This project will involve design and development of a quadruped robot, which will be a replica of MIT mini cheetah. Also the different possible gaits will be analyzed through kinematics and dynamics.",
        "Prerequisite": "Coding in Python, CAD"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Abhishek Sarkar",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "IMPLEMENTATION OF SLAM WITH A WHEELED MOBILE ROBOT",
        "ProjectDescription": "It is possible with a wheeled mobile equipped with IR sensors, Radar and LiDAR incorporated with visionto explore the unknown environment and collect visual information of from the environment and navigate. The mobile robot's observation data (LiDAR sensor and vision) is to be integrated with the odometer information for this purpose. The project will involve the implementation of mobile robot SLAM in an unknown environment.",
        "Prerequisite": "Python/Robot Operating System (ROS)"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Abhishek Sarkar",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "DESIGN OF A ROBOT HAND WITH COMPLIANT-JOINT",
        "ProjectDescription": "Typically robot joints are stiff in nature, which helps it to do precise and repetitive tasks. But, the spring action helps to adapt to unknown external forces. Replicating this in a robot hand will expand the possibilities to use it for a broad range of applications. This project will involve design of a multi-fingerhand with series-elastic actuator (SEA) based joints.",
        "Prerequisite": "CAD"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Abhishek Sarkar",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "GAIT GENERATION OF A BIPED ROBOT BASED ON ARTIFICIAL NEURAL NETWORK",
        "ProjectDescription": "Given the kinematic complexity of humanoid robots, the methods to control them are highly complex. Also for a biped robot balancing is its main challenge before implementation of any locomotion. This project will involve study of ANN based methods for achieving the walking gait of a biped robot.",
        "Prerequisite": "Python coding"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Kurra Suresh",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "IMAGE PROCESSING IN STRAINANALYSIS",
        "ProjectDescription": "Detection ellipse edges on sheet using image processing",
        "Prerequisite": "Image processing"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Kurra Suresh",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "IMAGE PROCESSING IN DIMENSIONALMEASUREMENTS",
        "ProjectDescription": "Detection of edges for thickness measurement",
        "Prerequisite": "Image processing"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Kurra Suresh",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "3D PRINTING OF HIGH PERFORMANCEPOLYMERS",
        "ProjectDescription": "Evaluation of properties of high performance polymers",
        "Prerequisite": "Material science, Polymers"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Kurra Suresh",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "3D PRINTING OF COMPOSITES",
        "ProjectDescription": "Evaluation of properties of 3D printed composites",
        "Prerequisite": "Composites, Material science"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Kurra Suresh",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "EVALUATION OF PAINT PERFORMANCEON COMPOSITE SUBSTRATE",
        "ProjectDescription": "Different tests will be conducted to evaluate the paint on composite substrate",
        "Prerequisite": "Material science"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Mrinal Ketan Jagirdar",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "SURVEY AND LITERATURE REVIEW OF ATMOSPHERIC WATER GENERATORS (AWG)",
        "ProjectDescription": "Fresh-water scarcity is a major problem in India as well as in a number of other countries. Atmospheric Water Generators (AWG) have been around for quite some time. However, electrical-power consumption of AWGs is quite high. Newer technologies such as desiccant-based AWGs hold promise since they can be used in conjunction with waste-heat (such as Solar-thermal energy). The student shall (i) explore commercially available AWG technologies, benchmarking parameters and critical numbers such as running cost (due to consumption of electrical power) per liter of water produced as well as initial cost, size of the AWG as well as its capacity (Liters/day), etc (ii) conduct a literature-review of research being conducted on various AWG technologies, especially those that run on low-grade heat and assimilate information regarding the aforementioned benchmarking parameters and critical numbers (iii) formulate an opinion regarding which technology is the most promising and provide recommendations for future research work that may lead to advanced AWGs that are widely adopted in the commercial market for use in various weather conditions (including extremely-dry, desert-like climate) (iv) novel ideas (from the student) for extension/modification of the project are welcome as well: for instance the student can perform a cost-comparison of potable water produced using AWGs and the cost of a mineral water-bottle.",
        "Prerequisite": "Courses completed should include Thermodynamics as well as Heat Transfer. Interest in exploring new technologies that are either still in research- phase or have very recently been commercialized. This may be either for the purpose of exploring technical ideas for a startup, academic research, etc."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Mrinal Ketan Jagirdar",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "SURVEY AND LITERATURE REVIEW OF COOLING TECHNOLOGIES USED FOR DATA CENTERS",
        "ProjectDescription": "Data Centers have become indispensable for Tech giants, companies requiring large data storage and processing capabilities, governments, military, academic institutions, etc. Data center market is growing at an unprecedented rate. They already consume ~1% of the global electricity usage. When it comes to warm climate such as that of India and Singapore, even among the most efficient of data-centers such as that of Google have a PUE (Performance Usage Effectiveness) of 1.15, meaning that an additional 15% (of the power consumed by the IT equipment) electricity is required for cooling (maintaining optimal room- temperature) of the server room. The student shall (i) explore commercially adopted cooling technologies for data-centers and especially note the PUEs recorded for different weather conditions (ii) conduct a literature-review of research being conducted on cooling technologies to make Data-centers greener (low PUE, i.e. PUE as close to 1 as possible) (iii) formulate an opinion regarding which technology is the most promising and provide recommendations for future research work that may lead to green Data Centers that are widely adopted in the commercial market for use in various weather conditions (iv) novel ideas (from the student) for extension/modification of the project are welcome as well.",
        "Prerequisite": "Courses completed should include Thermodynamics as well as Heat Transfer. Interest in exploring new technologies that are either still in research- phase or have very recently been commercialized. This may be either for the purpose of exploring technical ideas for a startup, academic research, etc"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Mrinal Ketan Jagirdar",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "SURVEY AND LITERATURE REVIEW OF NON-CONVENTIONAL AIR-CONDITIONING TECHNOLOGIES",
        "ProjectDescription": "Heating/cooling equipment in buildings is ubiquitous in the western world and India is catching up. Soon,HVAC (Heating Ventilation and Air-conditioning) market is projected to cross 200 Billion USD. HVAC equipment is used for maintaining indoor thermal comfort of people, storage of artefacts in museums, storage of military-equipment, laboratories, industrial processes such as food drying, etc. With countries committing to reduce carbon footprint and specifically India (DST) launching the Global cooling prize, a clear push for energy efficient HVAC equipment is evident, since they consume ~10% of the total electricity utilized globally. It is therefore imperative that the current VCRS (Vapor compression refrigeration system) technology for air-conditioning be replaced with greener, more efficient technologies. The student shall (i) explore commercially available air-conditioning technologies and especially note the COP in various weather conditions (ii) conduct a literature-review of research being conducted on advanced, more efficient cooling technologies, some of them being ultra-low-grade-heat driven desiccant dehumidification, Maisotsenko-cycle driven dew-point evaporative-coolers, etc (iii) formulate an opinion regarding which technology is the most promising and provide recommendations for future research work that may lead to better air-conditioners widely adopted in the commercial market for use in various weather conditions (iv) novel ideas (from the student) for extension/modification of theproject are welcome as well.",
        "Prerequisite": "Courses completed should include Thermodynamics as well as Heat Transfer. Interest in exploring new technologies that are either still in research- phase or have very recently been commercialized. This may be either for the purpose of exploring technical ideas for a startup, academic research, etc"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "N Suresh KumarReddy",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "CLASSIFICATION AND SELECTION OFCELLULAR MATERIALS",
        "Prerequsite": "Nil"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "N Suresh KumarReddy",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "GEOMETRIC MODELING OF CELLULARMATERIALS",
        "Prerequsite": "Nil"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "N Suresh Kumar Reddy",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "NUMERICAL SIMULATION OF MECHANICAL PROPERTIES OF CELLULARMATERIALS",
        "Prerequsite": "Nil"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "N Suresh KumarReddy",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "MECHANICS OF CELLULAR MATERIALSAND ITS APPLICATIONS"
    },{
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Nandanavanam Jalaiah",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "SYNTHESIS OF SALT IN MATRIX COMPOSITES - A REVIEW",
        "ProjectDescription": "Preparation and characterization of composite materials is a common practice in various fields of science and engineering, including the energy. This SOP expects to collate the recently published research papers and build a report/ manuscript for a possible communication to a peer reviewed journal or aconference of high repute.",
        "Prerequisite": "Good exposure to materials synthesis and the allied protocols followed."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Nitin Rameshrao Kotkunde",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "PRODUCT DESIGN AND DEVELOPMENT FOR AUTOMOTIVE APPLICATIONS",
        "ProjectDescription": "The project is related to design and development of dash board for passenger vehicles related to Indian content",
        "Prerequisite": "Knowledge of modelling and analysis software"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Nitin Rameshrao Kotkunde",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "PRODUCT DESIGN AND DEVELOPMENT FOR AUTOMOTIVE APPLICATIONS",
        "ProjectDescription": "The project is related to design and development of dash board for passenger vehicles related to Indian content",
        "Prerequisite": "Knowledge of modelling and analysis software"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Nitin Rameshrao Kotkunde",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "MECHANICAL BEHVAIOUR OF MG ALLOYS FOR AUTOMOTIVE APPLICATIONS",
        "ProjectDescription": "The project is related to flow stress and mechanical properties determination of Mg alloys for automotive applications",
        "Prerequisite": "Knowledge of material testing and mechanics of solids"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Nitin RameshraoKotkunde",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "BIAXIAL DEFORMATION BEHAVIOUR OFDIFFERENT MATERIALS",
        "ProjectDescription": "The implementation of developed fixture of biaxial testing on uniaxial testing machine. Then, testing ofdifferent materials and compared with uiaxial flow behaviour",
        "Prerequisite": "Testing of materials,mechanics of solids"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Nitin RameshraoKotkunde",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "STUDY OF ADDITIVE MANUFACTURINGAND THEIR APPLICATIONS"
    },{
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Nitin Rameshrao Kotkunde",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "THE NEXT GENERATION MATERIAL FOR LIGHTWEIGHT RAILWAY CAR BODYSTRUCTURES",
        "ProjectDescription": "The project is related to literature survey of light weight materials used for railway applications"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Pardha SaradhiGurugubelli Venkata",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "CFD INVESTIGATION OF VIV OF CIRCULAR CYLINDER WITH FLEXIBLE FINS",
        "ProjectDescription": "The work involves performing CFD simulations using an inhouse code. The students needs to proactive tocomplete the literature and perform a series of numerical simulation using an inhouse solver developed in the MATLAB environment.",
        "Prerequisite": "Basic understanding of CFD"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Pardha SaradhiGurugubelli Venkata",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "CFD SIMULATION OF A FREELY FALLING CIRCULAR CYLINDER",
        "ProjectDescription": "The work involves numerical simulation of a circular cylinder which is freely falling. The simulations needs to be performed on an inhouse CFD code which is in MATLAB",
        "Prerequisite": "Basic understanding of CFD and MATLAB"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Pavan KumarPenumakala",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "DESIGN AND ANALYSIS OF COMPOSITESTRUCTURES",
        "ProjectDescription": "The mechanical behaviour of composite structures will be analysed using numerical techniques"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Phaneendra KiranChaganti",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "TESTING OF BRAIDED COMPOSITEMATERIALS",
        "ProjectDescription": "Using hand layup technique the composite need to be prepared and need to be characterized usingdifferent mechanical testing techniques.",
        "Prerequisite": "ME F452-Composite materialcourse"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Ram Chandra Murthy Kalluri",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "SIMULATION OF RAREFIED GAS FLOWS",
        "ProjectDescription": "Require two students.",
        "Prerequisite": "Basic Knowledge of CFD and Experience using openfoam"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Ram Chandra Murthy Kalluri",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "SIMULATION OF FLOW AROUND BUILDINGS",
        "Prerequsite": "Experience using turbulencemodels in ANSYS Fluent for CFD."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Ram Chandra Murthy Kalluri",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "SIMULATION OF FLUID FLOW USING LATTICE BOLTZMANN METHOD",
        "Prerequsite": "OpenFOAM software will be used for simulation and experience using it isessential."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Ravi ShankerVidyarthy",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "COMPUTER VISION IN METALLURGY",
        "ProjectDescription": "efficient way to estimate the weld bead geometry using deep learning",
        "Prerequisite": "Python, Basic of machineleaning"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Ravi ShankerVidyarthy",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "STATISTICAL ANALYSIS OF THE BEADGEOMETRY IN A-TIG WELDING",
        "ProjectDescription": "Weld bead geometry analysis of the weld bead geometry to optimize the A-TIG process parameters",
        "Prerequisite": "Basic information of theArtificial neural network"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Ravi Shanker Vidyarthy",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "FEASIBILITY STUDY OF THE TIG WELDING PROCESS TO DEVELOPMENT OF THE TITANIUM ALLOY BASED ON WAAM PRINCIPAL"
    },{
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Ravi Shanker Vidyarthy",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "PARAMETRIC OPTIMIZATION OF THEFSW FOR JOINING OF THE AA2014 AND AA2219."
    },{
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Sandip ShridharraoDeshmukh",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "USE OF IMAGE PROCESSING TECHNIQUES FOR COMPONENTSIDENTIFICATION",
        "Prerequsite": "Knowledge of Image Processing"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Sandip ShridharraoDeshmukh",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "APPLICATION OF MACHINE LEARNING MODELS",
        "Prerequsite": "Coding Skills"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "SandipShridharrao Deshmukh",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "FLUID FLOW ANALYSIS IN HEAT EXCHAGER"
    },{
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Sujith R",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "BALLISTIC RESPONSE OF METALLICFOAMS"
    },{
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Sujith R",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "UNDERSTANDING THE ADSORPTION IN2D MATERIALS BY DFT STUDIES"
    },{
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Sujith R",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "LITHIUM ION BATTERY PERFORMANCETESTING"
    },{
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Sujith R",
        "isFormal": "Formal",
        "ProjectType": "LOP",
        "ProjectTitle": "FABRICATE A FUEL CELL BASED SYSTEMFOR ELECTRIC VEHICLES"
    },{
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Supradeepan K",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "DESIGN MODIFICATION OF TRACHEALTUBE"
    },{
        "courseOffered": "upcoming",
        "Department": "Mechanical",
        "Professor": "Supradeepan K",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "3D TRAVERSING MECHANISM FORAUTOMATED FARMING"
    },{
        "courseOffered": "upcoming",
        "Department": "Pharmacy",
        "Professor": "D Sriram",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "DRUG DISCOVERY",
        "ProjectDescription": "ANTI-INFECTIVE DRUG DISCOVERY",
        "Prerequisite": "MICROBIOLOGY, BASIC ORGANIC CHEMISTRYKNOWLEDGE"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Pharmacy",
        "Professor": "Nirmal Jayabalan",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "ARTIFICIAL INTELLIGENCE IN TOXICITY PREDICTION OF SYSTEMIC DRUGS",
        "ProjectDescription": "Objective of this work is to understand from the literature the role of artificial intelligence in predicting the various organ toxicity by systemic drugs"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Pharmacy",
        "Professor": "Nirmal Jayabalan",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "INTERACTION OF PHARMACEUTICAL EXCIPIENTS WITH DRUG TRANSPORTERS",
        "ProjectDescription": "Objective of this work is to collect the list of excipients that shows potential in altering the activity of transporters"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Pharmacy",
        "Professor": "Nirmal Jayabalan",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "THERMODYNAMICS OF NANOMICELLES",
        "ProjectDescription": "To understand the thermodynamic parameters (heat of fusion and free energy) of the micelles formation from thermogravimetric and DSC techniques."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Pharmacy",
        "Professor": "Nirmal Jayabalan",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "EFFECT OF HYDRATION TEMPERATURE ONDRUG SHAPE AND SIZE OF THE MICELLES.",
        "ProjectDescription": "To understand the effect of temperature of hydration on shape and size of the micelles based on the polymers of micelles from published literature."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Pharmacy",
        "Professor": "Nirmal Jayabalan",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "OCULAR TOXICITY OF VARIOUSPOLYMERS",
        "ProjectDescription": "The objective is to understand the toxicity of various polymers used in ocular drug delivery"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Pharmacy",
        "Professor": "Nirmal Jayabalan",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "STABILITY OF NANOMICELLES DELIVERYSYSTEM",
        "ProjectDescription": "To understand the Kinetics of Step-Wise Nanomicelles Association and Dissociation in its stability"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Pharmacy",
        "Professor": "Nirmal Jayabalan",
        "isFormal": "Formal",
        "ProjectType": "DOP",
        "ProjectTitle": "POLYMER CHEMISTRY AND ITSAPPLICATION IN HYDROGEL DRUG DELIVERY SYSTEMS",
        "ProjectDescription": "To understand the various characteristics of polymers which can be sued for the hydrogel delivery systems for modifying/alternations of the hydrogel properties"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Pharmacy",
        "Professor": "Nirmal Jayabalan",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "EMERGING TECH MODALITIES IN CHARACTERIZATION OF HYDROGELS",
        "ProjectDescription": "To understand the characterizations tools to evaluate the hydrogel properties like surface properties, microscopic structural determination etc.."
    },
    {
        "courseOffered": "upcoming",
        "Department": "Pharmacy",
        "Professor": "Nirmal Jayabalan",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "DRUG DELIVERY SYSEM TARGETING THEPOSTERIOR EYE-REVIEW OF PATENT AND COMMERCIAL PRODUCTS",
        "ProjectDescription": "To review the commercial products and to understand the patended technology of the various products"
    },
    {
        "courseOffered": "upcoming",
        "Department": "Physics",
        "Professor": "Subhash Narayan Karbelkar",
        "isFormal": "Formal",
        "ProjectType": "SOP",
        "ProjectTitle": "GRAVITATIONAL WAVES: RADIATION AND DETECTION",
        "ProjectDescription": "To study radiation of gravitational waves and their detection",
        "Prerequisite": "Taken atleast one course with me and participated well (as evidenced by A grade)"
    },
    {
        "isFormal": "Formal",
        "Department": "Chemical",
        "ProjectType": "SOP",
        "Professor": "D Purnima ",
        "ProjectTitle": "HEAVY METAL REMOVAL",
        "courseOffered": "previous",
        "students": [
            {
                "Name": "Harsh Vashistha",
                "Email": "f20180756@hyderabad.bits-pilani.ac.in"
            }
        ]
    },
    {
        "isFormal": "Formal",
        "Department": "Computer Science",
        "ProjectType": "LOP",
        "Professor": "Suvadip Batabyal",
        "ProjectTitle": "QUANTUM ARCHITECTURE",
        "courseOffered": "previous",
        "students": [
            {
                "Name": "Abhinav Bandaru",
                "Email": "f20180236@hyderabad.bits-pilani.ac.in"
            }
        ]
    },
    {
        "isFormal": "Formal",
        "Department": "Pharmacy",
        "ProjectType": "DOP",
        "Professor": "Akash Chaurasiya",
        "ProjectTitle": "DEVELOPMENT OF LIPSOMAL FORMULATION FOR ANTICANCER DRUGS",
        "courseOffered": "previous",
        "students": [
            {
                "Name": "Mansi Shah",
                "Email": "f20181074@hyderabad.bits-pilani.ac.in"
            }
        ]
    },
    {
        "isFormal": "Formal",
        "Department": "Economics",
        "ProjectType": "DOP",
        "Professor": "Dr. Thota Nagaraju",
        "ProjectTitle": "DERIVATIVES USAGE",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180748@hyderabad.bits-pilani.ac.in",
                "Name": "Divya Vora"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "DOP",
        "Professor": "Dr. SUMIT KUMAR CHATTERJEE",
        "ProjectTitle": "DESIGN OF HIGH SPEED ADDERS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20170724@hyderabad.bits-pilani.ac.in",
                "Name": "VELIDANDLA SRI RACHANA"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Mechanical & Manufacturing",
        "ProjectType": "LOP",
        "Professor": "K Ram Chandra Murthy ",
        "ProjectTitle": "CFD OF WIND FLOWS OVER LOW RISE BUILDINGS ",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181005@hyderabad.bits-pilani.ac.in",
                "Name": "Nivedan Vishwanath"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Chemistry",
        "ProjectType": "SOP",
        "Professor": "Prof. KVG Chandrashekhar",
        "ProjectTitle": "PHARMACOLOGICAL ADVANCEMENT OF QUINOXLINE DERIVATIVES",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180702@hyderabad.bits-pilani.ac.in",
                "Name": "Aditya Krishna"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "SOP",
        "Professor": "S.K. Sahoo",
        "ProjectTitle": "HARDWARE SECURITY",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190415@hyderabad.bits-pilani.ac.in",
                "Name": "Abhishek Revinipati"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Pharmacy",
        "ProjectType": "SOP",
        "Professor": "V Vamsi Krishna Venuganti",
        "ProjectTitle": "FUNCTIONALISED NANOPARTICLES FOR DRUG DELIVERY",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181068@hyderabad.bits-pilani.ac.in",
                "Name": "Snigdha Khare"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Economics",
        "ProjectType": "DOP",
        "Professor": "Dushyant Kumar",
        "ProjectTitle": "INFORMATION ECONOMICS AND PERFECT BAYESIAN NASH EQUILIBRIUM",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20170381@hyderabad.bits-pilani.ac.in",
                "Name": "Vashist"
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Mechanical & Manufacturing",
        "Professor": "K Ram Chandra Murthy ",
        "ProjectTitle": "DSMC SIMULATION OF RAYLEIGH BENARD FLOWS IN A RAREFIED REGIME",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181005@hyderabad.bits-pilani.ac.in",
                "Name": "Nivedan Vishwanath"
            }
        ]  
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "DOP",
        "Professor": "Dr. Sudha Radika ",
        "ProjectTitle": "BIOMEDICAL IMAGE PROCESSING ",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180764@hyderabad.bits-pilani.ac.in",
                "Name": "Amitesh Badkul"
            }
        ]  
    },
    {
        "isFormal": "Formal",
        "Department": "Pharmacy",
        "ProjectType": "DOP",
        "Professor": "Dr. Swati Biswas",
        "ProjectTitle": "MECHANISM OF EMT AND THERAPEUTIC STRATEGY IN CANCER",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181086@hyderabad.bits-pilani.ac.in",
                "Name": "Ipsita Gopal Kundu "
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Pharmacy",
        "ProjectType": "DOP",
        "Professor": "Dr.Arti Dhar",
        "ProjectTitle": "THERPEUTIC ROLE OF NOVEL PEPTIDES IN CARDIOMETABOLIC SYNDROME",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181096@hyderabad.bits-pilani.ac.in",
                "Name": "Shubham Khanuja "
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Phoenix",
        "Professor": "Dr. Alivelu Manga Parimi",
        "ProjectTitle": "KALMAN FILTER APPLICATIONS IN MICROGRIDS FOR STATE ESTIMATION AND STABILITY ISSUES ",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190443@hyderabad.bits-pilani.ac.in",
                "Name": "VISHWAS VASUKI GAUTAM"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Math",
        "ProjectType": "SOP",
        "Professor": "Dr Manish Kumar",
        "ProjectTitle": "MATHEMATICAL MODELLING OF COVID-19 USING IMAGE PROCESSING TECHNIQUES",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180795@hyderabad.bits-pilani.ac.in",
                "Name": "Viral Tiwari"
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Mechanical & Manufacturing",
        "Professor": "Pardha Saradhi G.",
        "ProjectTitle": "TWO WAY FLUID STRUCTURE INTERACTION (FSI) IN FLEXIBLE STRUCTURES WITH LOW MASS RATIOS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181005@hyderabad.bits-pilani.ac.in",
                "Name": "Nivedan Vishwanath"
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Phoenix",
        "Professor": "Parikshit Sahatiya",
        "ProjectTitle": "2D MATERIALS BASED PHOTODETECTORS ",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190415@hyderabad.bits-pilani.ac.in",
                "Name": "Abhishek Revinipati"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "SOP",
        "Professor": "SK Sahoo",
        "ProjectTitle": "QUANTUM CRYPTOGRAPHY",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20191276@hyderabad.bits-pilani.ac.in",
                "Name": "Sathvik Swaminathan"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Computer Science",
        "ProjectType": "LOP",
        "Professor": "Dr. Lov Kumar",
        "ProjectTitle": "SENTIMENT ANALYSIS USING ML TECHNIQUES",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180527@hyderabad.bits-pilani.ac.in",
                "Name": "Keshav Kabra"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Computer Science",
        "ProjectType": "DOP",
        "Professor": "Paresh Saxena",
        "ProjectTitle": "WORK ON MPQUIC ",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181032@hyderabad.bits-pilani.ac.in",
                "Name": "V Abhijeet"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Computer Science",
        "ProjectType": "DOP",
        "Professor": "Dr Subhrakanta Panda",
        "ProjectTitle": "BREAST CANCER DETECTION USING MACHINE LEARNING AND DIP",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180002@hyderabad.bits-pilani.ac.in",
                "Name": "Yash Arora"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "LOP",
        "Professor": "Soumya J",
        "ProjectTitle": "RISCV BASED NOC DESIGN",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180533@hyderabad.bits-pilani.ac.in",
                "Name": "Jay Shah"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Mechanical & Manufacturing",
        "ProjectType": "DOP",
        "Professor": " Dr. Nitin Kotkunde",
        "ProjectTitle": "PRODUCT DESIGN AND DEVELOPMENT STRATEGIES FOR AUTOMOTIVE APPLICATIONS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180925@hyderabad.bits-pilani.ac.in",
                "Name": "Avni Jain"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Pharmacy",
        "ProjectType": "SOP",
        "Professor": "Dr. ARTI DHAR",
        "ProjectTitle": "THERAPEUTIC POTENTIAL OF NOVEL MAD2 INHIBITORS IN OVARIAN CANCER",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20191176@hyderabad.bits-pilani.ac.in",
                "Name": "UTSA ROY"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Chemical",
        "ProjectType": "SOP",
        "Professor": "Dr. Jaideep Chaterjee",
        "ProjectTitle": "DESALINATION OF WATER USING RO",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180725@hyderabad.bits-pilani.ac.in",
        "Name": "Aditya Prashant Ambadkar"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Computer Science",
        "ProjectType": "LOP",
        "Professor": "Dr. Lov Kumar",
        "ProjectTitle": "TESTING OF AI MODELS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180436@hyderabad.bits-pilani.ac.in",
        "Name": "Arshdeep Singh"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Computer Science",
        "ProjectType": "LOP",
        "Professor": "R Gururaj",
        "ProjectTitle": "IMPLEMENTING LEXICAL AND SYNTAX ANALYSERS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180294@hyderabad.bits-pilani.ac.in",
        "Name": "Rupanshu Soi"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Civil",
        "ProjectType": "DOP",
        "Professor": "Prof K. Srinivas Raju",
        "ProjectTitle": "DROUGHT PREDICTION USING MACHINE LEARNING",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180368@hyderabad.bits-pilani.ac.in",
        "Name": "Abhinav Krishnan"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Computer Science",
        "ProjectType": "DOP",
        "Professor": "Tathagata Ray",
        "ProjectTitle": "COMPUTER VISION BASED QUALITY ASSURANCE OF MECHANICAL ASSEMBLY COMPONENTS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180079@hyderabad.bits-pilani.ac.in",
        "Name": "Shaurya Vijayvargiya"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "DOP",
        "Professor": "Mithun Mondal",
        "ProjectTitle": "DESIGN AND SIMULATION OF TEXTURED INSULATOR ",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180910@hyderabad.bits-pilani.ac.in",
                "Name": "Rishav Datta"
            }
        ]
    },
    {
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "SOP",
        "Professor": "SK Sahoo",
        "ProjectTitle": "CPS BASED SYSTEM FOR BIOMEDICAL APPLICATION",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20191310@hyderabad.bits-pilani.ac.in",
        "Name": "Shreya Gupta"
            }
        ]
    },
    {
        "isFormal": "Informal",
        "Department": "Computer Science",
        "Professor": "Prof. M.B. Srinivas",
        "ProjectTitle": "CLASSIFICATION OF INAGES WITH COMPLEX BACKGROUNDS USING TRANSFORMER NETWORKS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180436@hyderabad.bits-pilani.ac.in",
                "Name": "Arshdeep Singh"
            }
        ]
    },
    {
        "isFormal": "Informal",
        "Department": "Phoenix",
        "Professor": "Syed Ershad ",
        "ProjectTitle": "STUDY OF APPROXIMATE BOOTH MULTIPLIERS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190317@hyderabad.bits-pilani.ac.in",
        "Name": "Suraj S"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Math",
        "ProjectType": "SOP",
        "Professor": "PK Sahoo",
        "ProjectTitle": "COSMOLOGICAL MODELS IN MODIFIED GRAVITY",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190890@hyderabad.bits-pilani.ac.in",
        "Name": "Ritik Pachauri"
            }
        ]
    },
    {
        "isFormal": "Formal",
        "Department": "Economics",
        "ProjectType": "LOP",
        "Professor": "Archana Srivastava ",
        "ProjectTitle": "CORPORATE AND INVESTMENT BANKING (CIB): COVID-19 IMPACT AND RECOVERY.",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181115@hyderabad.bits-pilani.ac.in",
        "Name": "Kirthi Krishnan "
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Mechanical & Manufacturing",
        "Professor": "Dr.Sujith R",
        "ProjectTitle": "FUELCELL",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190756@hyderabad.bits-pilani.ac.in",
        "Name": "Sumanth K"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Civil",
        "ProjectType": "DOP",
        "Professor": "Murari Raja Raja Verma",
        "ProjectTitle": "LCA OF ENGINEERED WATER AND WASTEWATER TREATMENT PLANTS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180792@hyderabad.bits-pilani.ac.in",
        "Name": "Hemender Singh Chauhan"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "DOP",
        "Professor": "Professor Ponnalagu R N",
        "ProjectTitle": "MACHINE LEARNING METHODS FOR WATER PARAMETER ANALYSIS AND PREDICTION",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180329@hyderabad.bits-pilani.ac.in",
        "Name": "Rahul Ajmeria"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Computer Science",
        "ProjectType": "DOP",
        "Professor": "Dr. N.L. Bhanumurthy",
        "ProjectTitle": "AUTOMATIC COMMENT GENERATION OF CODE",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180172@hyderabad.bits-pilani.ac.in",
                "Name": "Abhinav Sukumar Rao"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "DOP",
        "Professor": "Dr Runa Kumari",
        "ProjectTitle": "SMART ANTENNAS FOR AEROSPACE APPLICATIONS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180476@hyderabad.bits-pilani.ac.in",
                "Name": "Avinash Bhat Pattaje"
            }
        ]
    },
    {
      
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "LOP",
        "Professor": "Parikshit Sahatiya",
        "ProjectTitle": "BROADBAND PHOTODETECTORS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180354@hyderabad.bits-pilani.ac.in",
                "Name": "Aakanksha Singh"
            }
        ]
    },
    {
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "SOP",
        "Professor": "Mithun Mondal",
        "ProjectTitle": "DISSOLVED GAS ANALYSIS (DGA) IN POWER TRANSFORMERS.",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190370@hyderabad.bits-pilani.ac.in",
        "Name": "Rithika Chavan"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "DOP",
        "Professor": "SANKET GOEL",
        "ProjectTitle": "MICROFLUIDIC DEVICES FOR ENERGY HARVESTING",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180005@hyderabad.bits-pilani.ac.in",
        "Name": "RAJEEV SRIKAR"
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Physics",
        "Professor": "Dr Rahul Nigam",
        "ProjectTitle": "GUIDED STUDY IN GENERAL RELATIVITY",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190930@hyderabad.bits-pilani.ac.in",
        "Name": "Bharath Variar"
            }
        ]
    },
    {
        "isFormal": "Formal",
        "Department": "Pharmacy",
        "ProjectType": "DOP",
        "Professor": "Nirmal J",
        "ProjectTitle": "PHARMACOLIGICAL INTERVENTIONS FOR UVEITIS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180490@hyderabad.bits-pilani.ac.in",
                "Name": "M.S.K Srujana"
            }
        ]
    },
    {
        "isFormal": "Formal",
        "Department": "Mechanical & Manufacturing",
        "ProjectType": "DOP",
        "Professor": "Sujith R",
        "ProjectTitle": "ANALYSIS OF THE HIGH STRAIN RATE DEFORMATION BEHAVIOR OF METALLIC FOAMS ",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180560@hyderabad.bits-pilani.ac.in",
        "Name": "Aditya Shukla "
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Pharmacy",
        "ProjectType": "DOP",
        "Professor": "Prof. Onkar Kulkarni",
        "ProjectTitle": "MEDICATION AND MANAGEMENT STRATEGIES FOR ALZHEIMER'S DISEASE",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181099@hyderabad.bits-pilani.ac.in",
        "Name": "Jahnavi Dharwadkar"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Pharmacy",
        "ProjectType": "DOP",
        "Professor": "Prof. Yogeeswari Perumal",
        "ProjectTitle": "MODELLING OF THERAPEUTIC AGENTS FOR ANTI SARS COV-2",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181095@hyderabad.bits-pilani.ac.in",
                "Name": "Shraddha Dumawat"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Economics",
        "ProjectType": "SOP",
        "Professor": "Nivedita Sinha",
        "ProjectTitle": "OPTIMAL CAPITAL STRUCTURE OF LISTED FIRMS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180913@hyderabad.bits-pilani.ac.in",
                "Name": "Phaneendra Tenneti"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Computer Science",
        "ProjectType": "DOP",
        "Professor": "Barsha Mitra",
        "ProjectTitle": "WEBSITE FINGERPRINTING",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180195@hyderabad.bits-pilani.ac.in",
                "Name": "Arpan Sarangi"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "DOP",
        "Professor": "Syed Arshad Ehmed",
        "ProjectTitle": "APPROCIMATE BOOTH MULTIPLIER DESIGN",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180448@hyderabad.bits-pilani.ac.in",
        "Name": "Abijith Y.L."
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Phoenix",
        "Professor": "Soumya J",
        "ProjectTitle": "RISC-V BASED NOC DESIGNING",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180448@hyderabad.bits-pilani.ac.in",
        "Name": "Abijith Y.L."
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Mechanical & Manufacturing",
        "ProjectType": "SOP",
        "Professor": "Sandeep Deshmukh",
        "ProjectTitle": "MACHINE LEARNING MODELS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180486@hyderabad.bits-pilani.ac.in",
                "Name": "Duggina charan"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Math",
        "ProjectType": "SOP",
        "Professor": "Debopam Chakraborty",
        "ProjectTitle": "STUDY OF ARITHMETIC OF ELLIPTIC CURVES AND ELLIPTIC CURVE CRYPTOGRAPHY",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180929@hyderabad.bits-pilani.ac.in",
                "Name": "T. Vamsi Krishna"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "LOP",
        "Professor": "Dr. Soumya J",
        "ProjectTitle": "ARITHMETIC BASED NETWORK ON CHIP DESIGN",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181041@hyderabad.bits-pilani.ac.in",
        "Name": "Venkatesh Rajagopalan"
            }
        ]
    },
    {
        "isFormal": "Formal",
        "Department": "Economics",
        "ProjectType": "DOP",
        "Professor": "Nivideta sinha",
        "ProjectTitle": "MERGER AND ACQUISITION IN PHARMACEUTICAL INDUSTRY",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181093@hyderabad.bits-pilani.ac.in",
        "Name": "Ashtha Simoniha"
            }
        ]
    },
    {
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "SOP",
        "Professor": "Amit Kumar Panda",
        "ProjectTitle": "EFFICIENT PRNG METHOD FOR HARDWARE SECURITY ",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190381@hyderabad.bits-pilani.ac.in",
        "Name": "Dhruv Makwana"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Chemistry",
        "ProjectType": "SOP",
        "Professor": "Tanmay Chatterjee",
        "ProjectTitle": "TADF LIGHTS 3RD GENERATION LIGHTS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180833@hyderabad.bits-pilani.ac.in",
                "Name": "Ashish Jhawar"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Mechanical & Manufacturing",
        "ProjectType": "DOP",
        "Professor": "Dr. Pavan Kumar Penumakala",
        "ProjectTitle": "COMPUTATIONAL MODELLING OF PULTRUDED COMPOSITES",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180875@hyderabad.bits-pilani.ac.in",
        "Name": "Chaitanya Peshin"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Mechanical & Manufacturing",
        "ProjectType": "SOP",
        "Professor": "N. Jalaiah",
        "ProjectTitle": "COLD THERMAL ENERGY STORAGE- A REVIEW",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20191360@hyderabad.bits-pilani.ac.in",
        "Name": "Rushmitha Chekuri"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Math",
        "ProjectType": "SOP",
        "Professor": "Santanu Koley",
        "ProjectTitle": "STOCHASTIC MODELLING OF WAVE ENERGY CONVERTER DEVICES",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190913@hyderabad.bits-pilani.ac.in",
                "Name": "Hareesh Uppada"
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Mechanical & Manufacturing",
        "Professor": "Dr. Nitin Kotkunde",
        "ProjectTitle": "REDESIGNING AUTOMOTIVE INTERIORS WITH AN EMPHASIS ON SUSTAINABILITY",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180875@hyderabad.bits-pilani.ac.in",
                "Name": "Chaitanya Peshin"
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Math",
        "Professor": "Depobam Chakraborty",
        "ProjectTitle": "ELLIPTIC CURVES AND ELLIPTIC CURVE CRYPTOGRAPHY",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190086@hyderabad.bits-pilani.ac.in",
        "Name": "Amogh Bharadwaj"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Biological Science",
        "ProjectType": "SOP",
        "Professor": "Vivek Sharma",
        "ProjectTitle": "TECHNIQUES TO STUDY RNA AND PROTEIN INTERACTION",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20171762@hyderabad.bits-pilani.ac.in",
        "Name": "Abhay Gupta"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Mechanical & Manufacturing",
        "ProjectType": "DOP",
        "Professor": "Pardha Saradhi",
        "ProjectTitle": "FLOW INDUCED ROTATION ON A SQUARE CYLINDER MOUNTED ON A TORSION SPRING",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180714@hyderabad.bits-pilani.ac.in",
        "Name": "Subhrat Praharaj"
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Computer Science",
        "Professor": "Dipanjan Chakravarty",
        "ProjectTitle": "REMOTE SENSING AND SOCIO ECONOMIC INDICATORS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190356@hyderabad.bits-pilani.ac.in",
        "Name": "Hritish Jain"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Chemical",
        "ProjectType": "SOP",
        "Professor": "D Purnima",
        "ProjectTitle": "EFFECT OF TREATMENT OF BIOMASS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180709@hyderabad.bits-pilani.ac.in",
                "Name": "Shubhanshu Gupta"
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Computer Science",
        "Professor": "DIPANJAN chakraborty",
        "ProjectTitle": "DISINFORMATION",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180141@hyderabad.bits-pilani.ac.in",
        "Name": "Karthik Shwtty"
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Mechanical & Manufacturing",
        "Professor": "Sujith Sir",
        "ProjectTitle": "DTF COMPUTATION ",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181104@hyderabad.bits-pilani.ac.in",
        "Name": "Shrivatsa Deshmukh"
            }
        ]
     
    },
    {   
        "isFormal": "Formal",
        "Department": "Computer Science",
        "ProjectType": "DOP",
        "Professor": "Dr. Tathagatha Ray",
        "ProjectTitle": "COMPUTER VISION BASED MECHANICAL ASSEMBLY ANALYSIS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180671@hyderabad.bits-pilani.ac.in",
                "Name": "Sriram Kodey"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Chemical",
        "ProjectType": "DOP",
        "Professor": "Arnab Dutta, Pankaj Kumar",
        "ProjectTitle": "BIODIESEL PRODUCTION - PLANT DESIGN AND SIMULATION",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180089@hyderabad.bits-pilani.ac.in",
        "Name": "Anant Kedia"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Economics",
        "ProjectType": "SOP",
        "Professor": "Archana Srivastava",
        "ProjectTitle": "IMPACT OF COVID 19 ON ECONOMY",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20170907@hyderabad.bits-pilani.ac.in",
        "Name": "Parth Krishna Sharma"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Economics",
        "ProjectType": "SOP",
        "Professor": "Shreya Biswas",
        "ProjectTitle": "TRENDS IN PORTFOLIOS OF INDIAN HOUSEHOLDS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20170907@hyderabad.bits-pilani.ac.in",
                "Name": "Parth Krishna Sharma"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Civil",
        "ProjectType": "SOP",
        "Professor": "KS Raju",
        "ProjectTitle": "PREDICTION OF RAINFALL IN TELANGANA USING MACHINE LEARNING ALGORITHMS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180119@hyderabad.bits-pilani.ac.in",
                "Name": "Nipun Tewari"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Computer Science",
        "ProjectType": "SOP",
        "Professor": "Lov Kumar",
        "ProjectTitle": "SENTIMENT ANALYSIS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20170885@hyderabad.bits-pilani.ac.in",
                "Name": "Suhas Reddy Nancherla"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Math",
        "ProjectType": "SOP",
        "Professor": "Michael alphonse",
        "ProjectTitle": "SINGULAR INTEGRALS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20170885@hyderabad.bits-pilani.ac.in",
                "Name": "Suhas Reddy Nancherla"
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Mechanical & Manufacturing",
        "Professor": "Sujith R.",
        "ProjectTitle": "BALLISTIC TESTING OF METAL FOAM COMPOSITES",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180983@hyderabad.bits-pilani.ac.in",
                "Name": "Rupangi"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Computer Science",
        "ProjectType": "SOP",
        "Professor": "Manik Gupta",
        "ProjectTitle": "CONVERSATIONAL AI FOR MENTAL HEALTH",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190265@hyderabad.bits-pilani.ac.in",
                "Name": "Anuradha Pandey"
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Phoenix",
        "Professor": "Parikshit Sir",
        "ProjectTitle": "WEARABLE SENSORS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180384@hyderabad.bits-pilani.ac.in",
                "Name": "Hitesh Aryan Acharya "
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Mechanical & Manufacturing",
        "Professor": "Sujith R",
        "ProjectTitle": "COMPUTATIONAL ANALYSIS OF 2D MATERIALS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181039@hyderabad.bits-pilani.ac.in",
        "Name": "Rakesh Prashant Ladi"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Computer Science",
        "ProjectType": "LOP",
        "Professor": "D V N Sivakumar ",
        "ProjectTitle": "PRIVACY-PRESERVING MULTI-KEYWORD SEARCH OVER ENCRYPTED DATA",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180473@hyderabad.bits-pilani.ac.in",
                "Name": "Divya Munipalle"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "SOP",
        "Professor": "Sudha Radhika",
        "ProjectTitle": "IOT BASE HEMS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190391@hyderabad.bits-pilani.ac.in",
                "Name": "Maitri Goel"
            }
        ]
    },
    {
        "isFormal": "Informal",
        "Department": "Mechanical & Manufacturing",
        "Professor": "Dr. Abhishek Sarkar",
        "ProjectTitle": "HUMANOID GAIT ANALYSIS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180518@hyderabad.bits-pilani.ac.in",
                "Name": "Om Kulkarni"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Pharmacy",
        "ProjectType": "DOP",
        "Professor": "D Sriram",
        "ProjectTitle": "NANO PARTICLE MODELLING FOR ALZHEIMER'S DISEASE",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181079@hyderabad.bits-pilani.ac.in",
        "Name": "Mahima Tejasvni Gupta"
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Computer Science",
        "Professor": "Manik Gupta",
        "ProjectTitle": "DEEP LEARNING FOR TIME SERIES CLASSIFICATION",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20191200@hyderabad.bits-pilani.ac.in",
        "Name": "Sathvik Bhaskarpandit"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Computer Science",
        "ProjectType": "DOP",
        "Professor": "Dipanjan Chakraborty",
        "ProjectTitle": "DISINFORMATION",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20171083@hyderabad.bits-pilani.ac.in",
                "Name": "BG Vamsi"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "LOP",
        "Professor": "Dr. R.N.Ponnalagu",
        "ProjectTitle": "IMPEDANCE CONTROL OF A SPHERICAL(3 DOF) ARTICULATED MANIPULATOR",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20171348@hyderabad.bits-pilani.ac.in",
                "Name": "Prathamesh Saraf"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Mechanical & Manufacturing",
        "ProjectType": "DOP",
        "Professor": "Dr. Arshad Javed",
        "ProjectTitle": "MOTION PLANNING AND GAIT ANALYSIS OF A QUADRUPED ROBOT ON UNEVEN TERRAINS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20171348@hyderabad.bits-pilani.ac.in",
                "Name": "Prathamesh Saraf"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Pharmacy",
        "ProjectType": "SOP",
        "Professor": "Onkar kulkarni",
        "ProjectTitle": "IMMUNOPROTEOSOME ",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180720@hyderabad.bits-pilani.ac.in",
                "Name": "Aarushi bhomia"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Physics",
        "ProjectType": "SOP",
        "Professor": "Subhash Narayan Karbelkar",
        "ProjectTitle": "MANY BODY QUANTUM MECHANICS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181014@hyderabad.bits-pilani.ac.in",
                "Name": "SVS Sai Ruthvik"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "SOP",
        "Professor": "Prof. Sanket Goel",
        "ProjectTitle": "FLEXIBLE MEMRISTOR FOR NEUROMORPHIC APPLICATIONS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20170959@hyderabad.bits-pilani.ac.in",
                "Name": "Aastha Dave"
            }
        ]
    },
    {
        
        "isFormal": "Informal",
        "Department": "Phoenix",
        "Professor": "Prof. Parikshit Sahatiya",
        "ProjectTitle": "LARGE AREA PRESSURE SENSOR FOR SMART FLOOR SENSOR APPLICATIONS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20170959@hyderabad.bits-pilani.ac.in",
                "Name": "Aastha Dave"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Economics",
        "ProjectType": "DOP",
        "Professor": "Prof. Archana Srivastava",
        "ProjectTitle": "A SECTORAL ANALYSIS OF THE EFFECT OF COVID-19 ANNOUNCEMENTS ON STOCK MARKET",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20170959@hyderabad.bits-pilani.ac.in",
                "Name": "Aastha Dave"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "SOP",
        "Professor": "Sandeep Kumar",
        "ProjectTitle": "INTELLIGENT TRANSPORT SYSTEMS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180440@hyderabad.bits-pilani.ac.in",
        "Name": "Guru Vardhan Kancharla"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Math",
        "ProjectType": "SOP",
        "Professor": "Sharan Gopal",
        "ProjectTitle": "A STUDY ON P-ADIC NUMBERS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180594@hyderabad.bits-pilani.ac.in",
                "Name": "Suyash garg"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Math",
        "ProjectType": "SOP",
        "Professor": "Santanu Koley",
        "ProjectTitle": "STOCHASTIC MODELING OF WAVE ENERGY CONVERTER DEVICE",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190850@hyderabad.bits-pilani.ac.in",
                "Name": "KHUSHI KHANNA"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Math",
        "ProjectType": "SOP",
        "Professor": "PK Sahoo",
        "ProjectTitle": "COSMOLOGICAL MODEL IN UNIFIED GRAVITY",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190869@hyderabad.bits-pilani.ac.in",
                "Name": "Raj Tripathi"
            }
        ]
    },
    {
        "isFormal": "Informal",
        "Department": "Math",
        "Professor": " Pratyusha Chattopadhyay",
        "ProjectTitle": "FUNDAMENTAL GROUP",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20191031@hyderabad.bits-pilani.ac.in",
                "Name": "Arundhati Ghose"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Math",
        "ProjectType": "SOP",
        "Professor": "Santanu Koley",
        "ProjectTitle": "STOCHASTIC MODELING OF WAVE ENERGY CONVERTER DEVICES",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181077@hyderabad.bits-pilani.ac.in",
                "Name": "BATHINI THARUN KUMAR REDDY"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Math",
        "ProjectType": "SOP",
        "Professor": "Dr. Pratyusha Chattopadhyay",
        "ProjectTitle": "PROPERTIES OF CLASSICAL GROUPS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20190699@hyderabad.bits-pilani.ac.in",
                "Name": "Shriya M"
            }
        ]
    },
    {
        "isFormal": "Formal",
        "Department": "Math",
        "ProjectType": "SOP",
        "Professor": "Praveen",
        "ProjectTitle": "ADAPTIVE LEARNING",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180868@hyderabad.bits-pilani.ac.in",
                "Name": "Abhinav"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Math",
        "ProjectType": "SOP",
        "Professor": "Santanu koley ",
        "ProjectTitle": "STOCHASTIC MODELLING OF WAVE ENERGY CONVERTOR DEVICES",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180147@hyderabad.bits-pilani.ac.in",
                "Name": "P.Prudhvi"
            }
        ]
    },
    {
        "isFormal": "Formal",
        "Department": "Math",
        "ProjectType": "LOP",
        "Professor": "PTV Praveen Kumar",
        "ProjectTitle": "ADAPTIVE LEARNING",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180039@hyderabad.bits-pilani.ac.in",
                "Name": "Vijay"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Math",
        "ProjectType": "SOP",
        "Professor": "TSL Radhika",
        "ProjectTitle": "PROBLEMS IN FLUID DYNAMICS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180922@hyderabad.bits-pilani.ac.in",
        "Name": "Kartheek Nadimpalli"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "LOP",
        "Professor": "Parikshit Sahatiya",
        "ProjectTitle": "BROADBAND PHOTODETECTION",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20171719@hyderabad.bits-pilani.ac.in",
                "Name": "Harini Raghavan"
            }
        ]
    },
    {
        "isFormal": "Formal",
        "Department": "Mechanical & Manufacturing",
        "ProjectType": "DOP",
        "Professor": "Dr. Nitin Ramesh kotkunde",
        "ProjectTitle": "LCA OF COCKPIT PARTS IN THE INDIAN AUTOMOBILE SCENARIO",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180793@hyderabad.bits-pilani.ac.in",
        "Name": "Tanay nagar"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Chemical",
        "ProjectType": "SOP",
        "Professor": "I Sreedhar",
        "ProjectTitle": "NANOMATERIAL ADSORBENTS IN HEAVY METAL REMOVAL",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181201@hyderabad.bits-pilani.ac.in",
              "Name": "Samyuktha"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Chemical",
        "ProjectType": "DOP",
        "Professor": "Pankaj Kumar & Arnab Dutta",
        "ProjectTitle": "TECHNOECONOMIC ANALYSIS AND PRODUCTION OF GREEN DIESEL",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20181201@hyderabad.bits-pilani.ac.in",
                "Name": "Samyuktha"
            }
        ]
    },
    {
        
        "isFormal": "Formal",
        "Department": "Phoenix",
        "ProjectType": "SOP",
        "Professor": "Ponnalagu R N",
        "ProjectTitle": "MEASUREMENT OF AIR QUALITY PARAMETERS",
        "courseOffered": "previous",
        "students": [
            {
                "Email": "f20180409@hyderabad.bits-pilani.ac.in",
                "Name": "Akshay Tomar"
            }
        ]
    }
]